[

	{
		"_id": {
			"$oid": "5951e01a88dba0193c32cba2"
		},
		"name": "karthick",
		"author": "Joe Watts",
		"others": [{
			"title": "'So there is a magic money tree?' Liam Fox challenged on Question Time over £1bn DUP deal",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-06-30T12:30:45Z",
			"url": "http://www.telegraph.co.uk/news/2017/06/30/magic-money-tree-liam-fox-challenged-question-time-1bn-dup-deal/",
			"author": null
		}, {
			"title": "Theresa May's schedule cleared of anything controversial to help her cling to power",
			"agencyName": "Independent",
			"publishedAt": "2017-07-12T14:10:23Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-aide-prime-minister-summer-recess-legislation-report-opposition-debates-delay-tory-a7836761.html",
			"author": "Joe Watts"
		}, {
			"title": "GOP may keep Obama tax on wealthy in bid to save health bill",
			"agencyName": "Associated Press",
			"publishedAt": "2017-06-30T11:12:37Z",
			"url": "https://apnews.com/828a888b728e4e2ba6413f5603eb9daa",
			"author": "ALAN FRAM"
		}, {
			"title": "Theresa May said she 'can't just promise people more money' after being asked to end public sector pay cap",
			"agencyName": "Independent",
			"publishedAt": "2017-07-19T12:57:35Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-public-sector-pay-cap-more-money-pmqs-jeremy-corbyn-conservative-leader-austerity-philip-a7848936.html",
			"author": "Ashley Cowburn"
		}, {
			"title": "On not hurting people’s delicate fee-fees",
			"agencyName": "Reddit /r/all",
			"publishedAt": null,
			"url": "http://sursumursa.tumblr.com/post/122859059489/on-not-hurting-peoples-delicate-fee-fees",
			"author": null
		}],
		"keywords": ["tree”", "despite", "“bribe”", "education", "ireland", "power", "stands", "save", "found", "botched", "–", "may", "theresa", "cash", "claimed", "boosting", "infrastructure", "cling", "premiership", "well", "handing", "money", "immediate", "uk-wide", "magic", "“no", "seal", "public", "northern", "unionists", "ms", "health", "powers", "lets", "using", "campaign", "branded", "deal”", "accused", "“grubby", "belfast", "gamble", "spending", "tax-raising", "agreement", "potentially", "may’s", "irish", "election", "new", "helps", "following", "faced", "backlash", "least", "£1bn"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/26/19/may-foster-getty.jpg",
		"publishedAt": "2017-06-27T07:27:54Z",
		"countryName": "Great Britain",
		"description": "Theresa May stands accused of using at least £1bn of public money to seal a “grubby deal” with Northern Irish unionists that lets her cling on to power. The cash – branded a “bribe” – helps save Ms May’s premiership following her botched election gamble and was found despite her having claimed during the campaign that there is “no magic money tree”. But the agreement boosting health, education and infrastructure spending in Northern Ireland, as well potentially handing Belfast new tax-raising powers, faced an immediate UK-wide backlash.",
		"summary": "Theresa May stands accused of using at least £1bn of public money to seal a “grubby deal” with Northern Irish unionists that lets her cling on to power.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Theresa May accused of £1bn ‘grubby deal’ to cling to power",
		"content": "The cash – branded a “bribe” – helps save Ms May’s premiership following her botched election gamble and was found despite her having claimed during the campaign that there is “no magic money tree”.But the agreement boosting health, education and infrastructure spending in Northern Ireland, as well potentially handing Belfast new tax-raising powers, faced an immediate UK-wide backlash. Political leaders from every home nation attacked it, with one branding it a “stitch-up”, another calling it a “shoddy little deal” and others warning it threatened peace in Northern Ireland. But Ms May insisted the bill – which could rise further – served “the whole United Kingdom”, while her ministers pointed out the full amount of money would only be delivered if Sinn Fein returned to power-sharing in Northern Ireland, breaking a three-month deadlock at Stormont.Monday’s announcement brought to an end weeks of painstaking talks between the Tories and the DUP, which saw sources in Northern Ireland mocking a lack of negotiating prowess on Ms May’s team.If the Prime Minister had failed to secure the DUP’s support, she may not have been able to pass a vote approving her legislative agenda, set out in the Queen’s Speech, leading to the likely collapse of her premiership. Combined, the Conservatives and DUP now have a total of 327 MPs, meaning if they all vote together, they have a working majority of 13.However, as DUP leader Arlene Foster announced the deal in a speech outside 10 Downing Street, the full cost of Ms May’s continued grip on power became clear. On top of existing spending, taxpayers across the UK will have to fork out an extra £400m for infrastructure in Northern Ireland, £350m more for health and education, another £150m for better broadband and £100m to tackle deprivation.The cash – equivalent to an extra £537 for every person in Northern Ireland – should in theory secure Ms May’s position for the entire Parliament in Westminster, but there will be ample opportunities for the DUP to up the stakes.The agreement document makes clear that the “aims, principles and implementation” of the deal will be up for review in 2019. Before then, support for votes on issues going beyond finance, Brexit and security matters, will be dealt with on a “case by case” basis.A further £500m could also be available to Northern Ireland as the UK Government agreed to loosen spending rules constraining existing money already committed to Belfast.Former permanent secretary to the Treasury Nick Macpherson branded it “profligacy”, adding on Twitter: “£1bn for Ulster is just a downpayment. DUP will be back for more...again and again... They have previous in such matters.” Ms May is also being forced to bring forward plans in the next Budget to hand Stormont power to set its own corporation tax rates. There have been widespread calls in Northern Ireland to reduce the province’s corporation tax to 12.5 per cent, in line with the Republic across the border, where many of the world’s biggest companies have chosen to base themselves.In another humiliation, Ms May was compelled to ditch a string of pledges from her Tory manifesto that the DUP did not like, including proposals to ditch the pensions triple lock and means-test the winter fuel payment.The deal will be overseen by an all-powerful “co-ordination committee”, chaired by the Government, but not including Northern Ireland Secretary James Brokenshire, who must be seen to remain politically neutral. Shadow Chancellor John McDonnell said: “The same Conservative Party which spent the recent election campaign saying there was no money available for the crisis in the NHS and schools has now found at least £1bn to buy a parliamentary majority, with some reports suggesting it could be as much as £2bn.”He added: “Let’s call this grubby deal what it is, this is a straightforward political bribe to desperately prop up Theresa May in office.”Labour’s leader in Wales Carwyn Jones branded it “a straight bung to keep a weak Prime Minister and a faltering Government in office”, calling it “outrageous that the Prime Minister believes she can secure her own political future by throwing money at Northern Ireland while completely ignoring the rest of the UK”.Plaid Cymru's leader in Westminster also said any commitments to Northern Ireland should be matched for Wales.Liberal Democrat outgoing leader Tim Farron said it is a “shoddy little deal”, adding: “The nasty party is back, propped up by the DUP.“While our schools are crumbling and our NHS is in crisis, Theresa May chooses to throw cash at ten MPs in a grubby attempt to keep her Cabinet squatting in No 10.”Scottish First Minister and SNP leader Nicola Sturgeon called it a “grubby DUP deal to let [Theresa May] cling to power”. Anti-Brexit campaigner Gina Miller said that Northern Ireland was continuing to take advantage of its already generous spending terms.“Even before the extra cash given to Northern Ireland, the province was already benefiting from £11,000 public spending per head of population, compared to just £8,8000 for England – how is this fair,” she told the Guardian.Attention quickly shifted on to Sinn Fein, whose participation in a power-sharing executive will be a requirement for the new funding to be allocated to Stormont.The party had previously refused to form an administration with Ms Foster following a row over a botched green energy scheme, but they did not rule out the possibility of a return on Monday evening, even signalling there is a way forward.Party president Gerry Adams said: “We may be able to say ‘well done Arlene’, when we have the executive in place.”He added in a statement: “There is work to be done by the DUP and only limited time to do this…the allocation of additional funds could help to ease the enormous pressure on our public services.“The devil is in the detail.”He focused his criticism on arguments that the deal would allow for “continued Tory austerity and cuts to public services” and a “Tory Brexit which threatens the Good Friday Agreement”.A particular sticking point could be a commitment to ensure the Armed Forces Covenant, which underpins the good treatment of British service personal, is implemented in Northern Ireland.Mr Adams said: “Sinn Fein will resolutely oppose any attempt to give preferential treatment to British forces, either in terms of legacy or the provision of public services.” If negotiators in Northern Ireland miss Thursday’s deadline for a new agreement to restore devolved government, they face the prospect of direct rule being reimposed from Westminster, and any additional spending being allocated by the UK Government. ",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-dup-deal-billion-pound-bribe-magic-money-tree-criticism-latest-a7809416.html"
	}, {
		"_id": {
			"$oid": "5951e01a88dba0193c32cba3"
		},
		"author": "Will Worley",
		"name": "karthick",
		"others": [{
			"title": "Tory MP refuses to appear on Channel 4 News after Jon Snow 'f**k the Tories' allegations",
			"agencyName": "Independent",
			"publishedAt": "2017-06-30T08:07:40Z",
			"url": "http://www.independent.co.uk/news/uk/politics/grant-shapps-channle-4-news-jon-snow-refuse-appear-f-word-tories-glastonbury-conservative-mp-a7815836.html",
			"author": "May Bulman"
		}, {
			"title": "Theresa May's £1billion DUP deal faces High Court challenge",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-09T18:08:31Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/09/theresa-mays-1billion-dup-deal-faces-high-court-challenge/",
			"author": null
		}, {
			"title": "Theresa May 'called David Cameron' to beg for his support on DUP deal",
			"agencyName": "Independent",
			"publishedAt": "2017-07-03T12:05:23Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-david-cameron-dup-deal-support-minority-government-conservative-leader-working-majority-a7820611.html",
			"author": "Harriet Agerholm"
		}, {
			"title": "'So there is a magic money tree?' Liam Fox challenged on Question Time over £1bn DUP deal",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-06-30T12:30:45Z",
			"url": "http://www.telegraph.co.uk/news/2017/06/30/magic-money-tree-liam-fox-challenged-question-time-1bn-dup-deal/",
			"author": null
		}, {
			"title": "SNP threaten formal dispute over DUP deal as they claim David Mundell's position as Scottish Secretary is 'becoming untenable'",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-06-27T15:44:31Z",
			"url": "http://www.telegraph.co.uk/news/2017/06/27/snp-threaten-formal-dispute-dup-deal-claim-david-mundells-position/",
			"author": null
		}
	],
		"keywords": ["ireland", "interview", "legitimacy", "unionist", "theresa", "villiers", "live", "repeatedly", "secretary", "endured", "(dup)", "northern", "deal", "refused", "radio", "answer", "torrid", "question", "party", "former", "democratic", "government"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2013/10/29/18/web-villiers-getty.jpg",
		"publishedAt": "2017-06-27T08:59:15Z",
		"countryName": "Great Britain",
		"description": "Former Northern Ireland Secretary Theresa Villiers endured a torrid interview on live radio during which she repeatedly refused to answer a question about the legitimacy of the Government's deal with the Democratic Unionist Party (DUP).",
		"summary": "Former Northern Ireland Secretary Theresa Villiers endured a torrid interview on live radio during which she repeatedly refused to answer a question about the legitimacy of the Government's deal with the Democratic Unionist Party (DUP).",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Tory MP repeatedly asked how Government can stay impartial in Northern Ireland after the DUP deal - and she can't answer",
		"content": "Prime Minister Theresa May secured a supply and confidence\" deal with the Northern Irish party, which will support the government in motions of confidence and appropriation or budget votes, by either voting in favour or abstaining.In return the party secured £1bn of extra funding, which will be spent on infrastructure and health spending.Ms Villiers refused to say whether funding had ever previously been granted to the historically troubled region in exchange for votes.Northern Ireland’s power sharing agreement – drawn up because of its turbulent recent history – means the Westminster government is supposed to remain neutral in regional affairs. It was pointed out to Ms Villiers by LBC presenter James O’Brien pointed out that as the DUP had secured the extra funding, they would be able to present it to voters as their achievement  – thereby raising the prospect that the Conservative government has breached its impartiality.Ms Villiers was asked numerous times about the legitimacy of the funding, given it was contingent on votes. Mr O’Brien said: “Can you remember any occasion in the history of Northern Ireland when one side of Stormont have been given money in exchange for votes in Westminster?”She replied: “There have been occasions when individual political parties have asked for support for particular projects in Westminster.” Mr O’Brien said: \"That's not the question I'm asking, is it?\"She replied: \"Well that's the answer I'm giving you.\"What does the DUP deal mean for N Ireland? @mrjamesob was forced to ask that question AGAIN and AGAIN to a Tory MP https://t.co/xAr2YhmjZhThe deal, struck in 10 Downing Street 18 days after the General Election, also saw the Conservatives formally ditch plans to abolish the triple-lock protection for state pensions and means-test the winter fuel payment during this Parliament.Under the deal, intended to last for the full Parliament, the DUP guarantees that its 10 MPs will vote with the Government on the Queen's Speech, the Budget, and legislation relating to Brexit and national security.Together with the 317 Tory MPs remaining after Mrs May's disastrous decision to call a snap election, this will give the Prime Minister just enough MPs to clear the 326 level required for an absolute majority in the House of Commons, ensuring her victory in key divisions.Speaking after talks in Number 10 with DUP leader Arlene Foster, Mrs May said the two parties \"share many values\" and the agreement was \"a very good one\".Mrs Foster said she was \"delighted\" with a package which includes £1 billion of new funding for infrastructure and health spending, along with enhanced flexibility on almost £500 million of previously allocated cash.But there were immediate demands for other parts of the UK to receive similar largesse, with Plaid Cymru saying Wales should be entitled to £1.7 billion on a population-weighted basis.Additional reporting by Press Association. ",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/dup-deal-theresa-villiers-lbc-cash-for-votes-northern-ireland-secretary-live-james-o-brien-a7808896.html"
	}, {
		"_id": {
			"$oid": "59552a9888dba01cc481fd4a"
		},
		"author": "Rob Merrick",
		"name": "karthick",
		"others": [{
			"title": "Scotland and Wales to withhold legislative consent from Theresa May's Brexit Repeal Bill, first ministers say",
			"agencyName": "Independent",
			"publishedAt": "2017-07-13T17:03:52Z",
			"url": "http://www.independent.co.uk/news/uk/politics/brexit-great-repeal-bill-scotland-wales-carwyn-jones-nicola-sturgeon-theresa-may-legislative-consent-a7839706.html",
			"author": "Jon Stone"
		}, {
			"title": "The government is about to give itself powers to scrap your rights without a vote in parliament. Labour has vowed to fight them",
			"agencyName": "Independent",
			"publishedAt": "2017-07-13T07:26:24Z",
			"url": "http://www.independent.co.uk/news/uk/politics/labour-brexit-repeal-bill-vote-against-theresa-may-changes-keir-starmer-jeremy-corbyn-leave-eu-a7838516.html",
			"author": "Rob Merrick"
		}, {
			"title": "Theresa May facing Tory rebellion over UK's departure from nuclear regulator Euratom",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-10T19:09:58Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/10/theresa-may-facing-tory-rebellion-uks-departure-nuclear-regulator/",
			"author": null
		}, {
			"title": "Theresa May's first year in Number 10: How her fall in popularity compares to former Prime Ministers",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-13T07:00:23Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/13/theresa-mays-first-year-number-10-fall-popularity-compares-former/",
			"author": null
		}, {
			"title": "Theresa May is in a mess because she isn't a proper Brexiteer. The next Prime Minister must be",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-17T18:22:35Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/17/theresa-may-mess-isnt-proper-brexiteer-next-prime-minister-must/",
			"author": null
		}],
		"keywords": ["forced", "months", "minister’s", "brexit", "abortion", "order", "defeats", "new", "may", "ending", "come", "series", "ireland", "prime", "force", "charges", "theresa", "women", "seized", "mps", "pass", "–", "weakened", "vote", "northern", "speech", "queen’s", "commons", "revolt", "caved", "backbench", "rebellions", "vowing", "including", "faces", "first", "climbdown", "england", "parliament", "travel"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/29/21/theresa-may.jpg",
		"publishedAt": "2017-06-29T21:14:12Z",
		"countryName": "Great Britain",
		"description": "A weakened Theresa May faces a series of Commons rebellions after she caved in to the first backbench revolt of the new Parliament in order to pass a vote on the Queen’s Speech. MPs seized on the Prime Minister’s climbdown – ending abortion charges for women from Northern Ireland forced to travel to England – by vowing to force defeats in the months to come, including over Brexit.",
		"summary": "A weakened Theresa May faces a series of Commons rebellions after she caved in to the first backbench revolt of the new Parliament in order to pass a vote on the Queen’s Speech.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Theresa May faces series of rebellions after embarrassing climbdown over abortion vote",
		"content": "MPs seized on the Prime Minister’s climbdown – ending abortion charges for women from Northern Ireland forced to travel to England – by vowing to force defeats in the months to come, including over Brexit.The warning came after a breathtaking U-turn pledged free NHS terminations for the many hundreds of pregnant Northern Irish women who make the journey across the Irish Sea every year.Chancellor Philip Hammond interrupted his own speech in the Commons to hurriedly promise MPs that the need to pay for a private abortion would be scrapped – at an annual cost of £1m.Just hours earlier, the Department of Health had denied there was even a consultation into making the change, despite pressure to do so.But several Conservative backbenchers had backed Labour MPs in calling for free terminations, threatening the Government with its first defeat, just one week into the new Parliament.In the Commons, Tory backbenchers warned more rebellions were on the cards, as Tom Tugendhat and Bob Neill vowed they would not stand by and allow the pursuit of a hard Brexit based on “ideology”, rather than the needs of the economy.Another Conservative MP, Heidi Allen, called on the Prime Minister to “be compassionate” rather than focusing merely on economic competence, telling her: “This party must change.”Many at Westminster believe the May Government is only holding on because Tory MPs’ cannot agree on who would be best to take over as Prime Minister and their desire to avoid another general election.The Government’s perilous position was also laid bare by a succession of Cabinet ministers being flown back to bolster numbers for the Queen’s Speech votes.The Prime Minister herself cut short a visit to Berlin to prepare for next month’s G20 summit, which included talks with the German Chancellor Angela Merkel.Sarah Champion, Labour’s shadow women and equalities minister, said: “The threat of defeat, forced by the Labour Party, shows how weak the Tories are.”Former Labour minister David Lammy said: “We were promised strong and stable but, before the Queen’s Speech was even voted on, we have already seen a U-turn.”And Tom Brake, the Lib Dem Brexit spokesman, said: “This whole episode exposes Theresa May’s weakness.“The Government has been forced to concede because it doesn’t have the numbers any more. This opens up the possibility of more concessions – including on Brexit.”In the German capital earlier in the day, Ms Merkel said Ms May had “asked for your indulgence” for having to leave before a planned joint press conference – because of the need to be at Westminster.James Brokenshire, the Northern Ireland Secretary, left the Belfast talks to restore power sharing early – just as Foreign Secretary Boris Johnson had returned from Cyprus reunification talks before they had finished, a day earlier.The abortion climbdown came just 24 hours after No 10 appeared to bend to pressure to end the harsh 1 per cent public sector pay cap, before the Treasury stamped on that concession.Ms May still faces a revolt by dozens of Tory MPs if she refuses to axe the pay cap, due to run until the end of the decade.Nevertheless, the Prime Minister – crucially – succeeded in passing her Queen’s Speech, a milestone moment given the many traumas since her general election disaster.It passed with a majority of 14, one more than her working “majority” with the controversial support of the ten Democratic Unionist MPs.Labour’s split on Brexit was also laid bare when 49 of the party’s MPs defied Jeremy Corbyn by backing a rebel motion calling for Britain to stay in the EU single market and customs union.The revolt triggered the sackings of three Labour frontbenchers, with another resigning, as the Labour leader used his new authority to impose order immediately.Mr Corbyn had ordered his MPs to abstain, after his amendment called instead for the “exact same benefits” to be achieved outside the single market, mirroring the Government’s stance.Behind the scenes, a shadow Cabinet is being fought over the policy, with some senior Labour figures pushing for trying to stay in a “reformed” single market.The abortion U-turn was confirmed in a letter to MPs sent by equalities minister Justine Greening, who promised the NHS in England would not be short-changed.“I share the concerns of many colleagues about the experience of women from Northern Ireland obtaining an abortion through the NHS in England,” Ms Greening wrote.Charities hailed the decision as a “landmark moment”, while still criticising the “gross injustice whereby women in Northern Ireland are denied access to abortion care at home”.",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-abortion-northern-ireland-mps-rebellions-u-turn-funding-a7815681.html"
	}, {
		"_id": {
			"$oid": "59552a9b88dba01cc481fd52"
		},
		"author": "May Bulman",
		"name": "karthick",
		"others": [{
			"title": "U.S. appeals court upholds nondisclosure rules for surveillance orders",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-17T18:17:06Z",
			"url": "http://www.reuters.com/article/us-usa-surveillance-idUSKBN1A21XJ",
			"author": "Dustin Volz"
		}, {
			"title": "Daniel Greenfield: America is Not a Nation Ruled by Judges » Politichicks.com",
			"agencyName": "Reddit /r/all",
			"publishedAt": "2017-07-15T14:42:25Z",
			"url": "http://politichicks.com/2017/07/daniel-greenfield-america-not-nation-ruled-judges/",
			"author": "Daniel Greenfield"
		}, {
			"title": "Court turns down 10-year-old rape survivor’s plea to abort - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-07-19T05:28:00Z",
			"url": "http://timesofindia.indiatimes.com/india/court-turns-down-10-year-old-rape-survivors-plea-to-abort/articleshow/59657971.cms",
			"author": "Shimona Kanwar"
		}, {
			"title": "Suicide Act breaches human right to dignity, high court told",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-07-17T12:20:29Z",
			"url": "https://www.theguardian.com/society/2017/jul/17/assisted-dying-suicide-act-high-court-challenge-royal-courts-of-justice",
			"author": "Owen Bowcott"
		}, {
			"title": "Trump administration to appeal travel ban ruling to Supreme Court",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-14T18:24:56Z",
			"url": "http://www.reuters.com/article/us-usa-immigration-ruling-sessions-idUSKBN19Z248",
			"author": "Reuters Editorial"
		}],
		"keywords": ["compatible", "private", "abortion", "ruled", "courts", "abortions", "high", "2016", "ireland", "whether", "allowing", "provision", "thursday", "uphold", "rule", "rape", "rulings", "ruling", "appeal", "assembly", "existing", "right", "stormont", "refused", "two", "set", "laws", "northern", "victims", "law", "woman’s", "left", "said", "court", "european", "breached", "decide", "life", "reform", "2015"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/02/08/22/20-abortion-uk-get.jpg",
		"publishedAt": "2017-06-29T15:18:57Z",
		"countryName": "Great Britain",
		"description": "The Court of Appeal  in Northern Ireland has refused to rule on allowing rape victims to have abortions, ruling that it is not up the courts to decide on abortion law. Northern Ireland's Appeal Court said abortion reform should be left to Stormont's Assembly as it ruled that the law was compatible with existing provision.  The court was set to decide on Thursday whether to uphold two high court rulings from 2015 and 2016 that ruled existing abortion laws breached a woman’s right to a private life under European law.",
		"summary": "The Court of Appeal  in Northern Ireland has refused to rule on allowing rape victims to have abortions, ruling that it is not up the courts to decide on abortion law.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Appeal court refuses to rule on whether abortion laws in Northern Ireland violate human rights",
		"content": "Northern Ireland's Appeal Court said abortion reform should be left to Stormont's Assembly as it ruled that the law was compatible with existing provision. The court was set to decide on Thursday whether to uphold two high court rulings from 2015 and 2016 that ruled existing abortion laws breached a woman’s right to a private life under European law.The rulings, which involved women and girls who were unable to undergo abortions in local hospitals in cases of fatal foetal abnormality or who had become pregnant through sexual crimes, were appealed by the Department of Justice and Northern Ireland's attorney general.The NI Human Rights Commission (NIHRC), which brought the original case, was cross-appealing on Thursday and re-introduced all of the original grounds it brought before the High Court.But the Appeal Court said the issue of abortion reform should be left to Stormont’s Assembly.Unlike the rest of the UK, it is unlawful to perform a termination of pregnancy abortion in Northern Ireland unless a woman's life is at risk or there is a permanent or serious risk to her mental or physical health.The punishment for breaking this law, under section 58 of the Offences against the Person Act 1861, is life imprisonment. Responding to the ruling, Emma Norton, lawyer for human rights campaign group Liberty, said it was a \"sad day\" from women across the UK.“This is a devastating ruling for women and girls in Northern Ireland – especially after the High Court’s landmark decision that the current law does breach their human rights,\" she said.“A system that threatens women with life imprisonment in Northern Ireland – but allows those in England, Scotland and Wales to exercise their rights – is outrageous, unfair and completely unsustainable.\"It’s a sad day for women across the UK that these very reasonable proposals were dismissed, but there is hope in the indication that the case will go on to the Supreme Court.”The court ruling comes as the Speaker in the House of Commons selected an amendment to the Queen's Speech relating to access to abortions for women from Northern Ireland.More than 50 MPs from all the major parties have signed the amendment, co-ordinated by Labour's Stella Creasy, which calls on the government to allow women in Northern Ireland to have abortions for free in England, instead of being charged as they are now.A vote on the amendment is likely to be held after 5pm on Thursday.It comes amid renewed political focus on abortion law in the light of the Democratic Unionist Party’s (DUP) deal with Theresa May.The party is vehemently opposed to reforming Northern Ireland’s abortion laws, and has joined forces with others in the Stormont parliament to vote against legislation aimed at allowing terminations in cases of fatal foetal abnormality and women and girls made pregnant through rape or incest.Amnesty International issued a warning following the General Election that the negotiations to establish the next UK Government must not trade away long overdue abortion law reform in Northern Ireland.The DUP has previously blocked attempts to reform the region’s abortion laws, which date back to 1861 and have been found to breach women’s rights. In recent years, the DUP has also sought to reinforce the criminalisation of women who seek abortions in Northern Ireland through proposed amendments to a Justice Bill.A survey by the Northern Ireland Life and Times revealed earlier this month revealed an overwhelming majority of Northern Irish people favour reform of the country’s abortion laws.",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/home-news/top-court-refuses-rule-rape-victims-abortions-a7814206.html"
	}, {
		"_id": {
			"$oid": "595619cf88dba014b4ff6576"
		},
		"author": "talkSPORT",
		"name": "karthick",
		"others": [{
			"title": "CONFIRMED! Simon Grayson named as new Sunderland manager",
			"agencyName": "TalkSport",
			"publishedAt": "2017-06-29T18:44:44Z",
			"url": "http://talksport.com/football/confirmed-simon-grayson-named-new-sunderland-manager-170629244821",
			"author": "talkSPORT"
		}, {
			"title": "AFC Bournemouth news: Harry Arter signs new four-year deal with Premier League club",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-13T17:30:34Z",
			"url": "http://talksport.com/football/afc-bournemouth-news-harry-arter-signs-new-four-year-deal-premier-league-club-170713246628",
			"author": "talkSPORT"
		}, {
			"title": "NEW CONTRACT! West Ham defender Angelo Ogbonna signs new five-year deal to stay at club",
			"agencyName": "TalkSport",
			"publishedAt": "2017-06-30T15:05:04Z",
			"url": "http://talksport.com/football/new-contract-west-ham-defender-angelo-ogbonna-signs-new-five-year-deal-stay-club",
			"author": "talkSPORT"
		}, {
			"title": "Manchester United contract news: Sergio Romero signs four-year deal",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-16T20:06:11Z",
			"url": "http://talksport.com/football/manchester-united-contract-news-sergio-romero-signs-four-year-deal-170716246926",
			"author": "talkSPORT"
		}, {
			"title": "CONFIRMED: Manchester City sign Kyle Walker from Tottenham on five-year deal",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-14T14:40:33Z",
			"url": "http://talksport.com/football/confirmed-manchester-city-sign-kyle-walker-tottenham-five-year-deal-170714246745",
			"author": "talkSPORT"
		}],
		"keywords": ["manager", "league", "black", "trade", "2011", "plying", "grayson", "ireland", "successful", "one-year", "season", "simon", "confirmed", "made", "12", "28", "alex", "republic", "premier", "david", "ferguson’s", "since", "sir", "appearances", "new", "deal", "central", "international", "defender", "cats", "moyes", "sunderland", "signed", "club", "john", "captain", "years", "manchester", "relegated", "o’shea", "last", "united"],
		"agencyId": "talksport",
		"urlToImage": "http://talksport.com/sites/default/files/field/image/201706/oshea.jpg",
		"publishedAt": "2017-06-30T15:57:23Z",
		"countryName": "Great Britain",
		"description": "Sunderland captain John O’Shea has signed a new one-year deal with the club, new manager Simon Grayson confirmed. The Republic of Ireland international has been with the Black Cats since 2011 after 12 successful years plying his trade with Sir Alex Ferguson’s Manchester United. The central defender made 28 appearances last season as Sunderland were relegated from the Premier League under David Moyes.",
		"summary": "",
		"agencyName": "TalkSport",
		"countryId": "gb",
		"title": "CONFIRMED! Sunderland captain John O'Shea signs new one-year deal with the club",
		"content": "",
		"category": "sport",
		"url": "http://talksport.com/football/confirmed-sunderland-captain-john-oshea-signs-new-one-year-deal-club-170630244946"
	}, {
		"_id": {
			"$oid": "59564f3f88dba014b4ff683d"
		},
		"author": "By Reuters",
		"name": "karthick",
		"others": [{
			"title": "S.Korea's new government proposes military talks with N.Korea",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-17T08:59:20Z",
			"url": "http://www.dailymail.co.uk/wires/reuters/article-4702398/S-Koreas-new-government-proposes-military-talks-N-Korea.html",
			"author": "By Reuters"
		}, {
			"title": "Melania is not 'going to put up with it much longer' claims Mika",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-06-30T21:14:18Z",
			"url": "http://www.dailymail.co.uk/news/article-4655284/Mika-claims-lady-doing-job-Barron-s-sake.html",
			"author": "By Francesca Chambers, White House Correspondent For Dailymail.com"
		}, {
			"title": "Canada's Trudeau warns against 'tempting shortcuts' in NAFTA...",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-14T18:58:44Z",
			"url": "http://www.dailymail.co.uk/wires/reuters/article-4697778/Canadas-Trudeau-warns-against-tempting-shortcuts-NAFTA-renegotiations.html",
			"author": "By Reuters"
		}, {
			"title": "30 Questions and Mysteries From the New 'Star Wars: The Last Jedi' Footage",
			"agencyName": "Entertainment Weekly",
			"publishedAt": "2017-07-15T22:46:30Z",
			"url": "http://ew.com/movies/star-wars-last-jedi-d23-behind-scenes-footage",
			"author": "Anthony Breznican"
		}, {
			"title": "The internet briefly mourns Chris Evans' dog, who is still very much alive",
			"agencyName": "Mashable",
			"publishedAt": "2017-07-08T21:33:23.235Z",
			"url": "http://mashable.com/2017/07/08/chris-evans-dog-tweet/",
			"author": "Chloe Bryan"
		}],
		"keywords": ["still", "minister", "-", "britain", "restore", "said", "northern", "30", "believes", "conclusion", "talks", "june", "possible", "(reuters)", "dublin", "ireland", "successful"],
		"agencyId": "daily_mail",
		"urlToImage": "http://i.dailymail.co.uk/i/pix/m_logo_636x382px.png",
		"publishedAt": "2017-06-30T19:57:35Z",
		"countryName": "Great Britain",
		"description": "DUBLIN, June 30 (Reuters) - Britain's Northern Ireland  minister said he still believes a successful conclusion is  possible in talks to restore...",
		"summary": "",
		"agencyName": "Daily Mail",
		"countryId": "gb",
		"title": "N.Irish political paralysis can't last for much longer, Britain warns",
		"content": "",
		"category": "entertainment",
		"url": "http://www.dailymail.co.uk/wires/reuters/article-4655642/N-Irish-political-paralysis-longer-Britain-warns.html"
	}, {
		"_id": {
			"$oid": "595655cf88dba014b4ff68a6"
		},
		"author": "Reuters Editorial",
		"name": "karthick",
		"others": [{
			"title": "DUP and Sinn Féin close to Northern Ireland power-sharing deal",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-06-30T17:06:32Z",
			"url": "https://www.theguardian.com/uk-news/2017/jun/30/dup-and-sinn-fein-close-to-northern-ireland-power-sharing-deal",
			"author": "Henry McDonald"
		}, {
			"title": "The government is about to give itself powers to scrap your rights without a vote in parliament. Labour has vowed to fight them",
			"agencyName": "Independent",
			"publishedAt": "2017-07-13T07:26:24Z",
			"url": "http://www.independent.co.uk/news/uk/politics/labour-brexit-repeal-bill-vote-against-theresa-may-changes-keir-starmer-jeremy-corbyn-leave-eu-a7838516.html",
			"author": "Rob Merrick"
		}, {
			"title": "Government minister strongly hints at ending public sector pay freeze",
			"agencyName": "Independent",
			"publishedAt": "2017-07-03T14:55:38Z",
			"url": "http://www.independent.co.uk/news/uk/politics/public-sector-pay-cap-latest-news-end-police-minister-nick-hurd-income-freeze-cabinet-a7821216.html",
			"author": "Tom Peck"
		}, {
			"title": "Power restored after widespread Los Angeles outage",
			"agencyName": "Google News",
			"publishedAt": "2017-07-09T16:52:40Z",
			"url": "http://abcnews.go.com/US/wireStory/power-restored-widespread-los-angeles-outage-48532251",
			"author": "ABC News"
		}, {
			"title": "Most top UK ministers back Brexit transition period: Hammond",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-16T09:55:16Z",
			"url": "http://www.reuters.com/article/us-britain-eu-idUSKBN1A10AG",
			"author": "Reuters Editorial"
		}],
		"keywords": ["without", "believes", "province", "britain", "ireland", "successful", "minister", "longer", "conclusion", "cannot", "still", "restore", "power-sharing", "period", "said", "devolved", "much", "northern", "continue", "talks", "possible", "government"],
		"agencyId": "reuters",
		"urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02\u0026d=20170630\u0026t=2\u0026i=1191205130\u0026w=\u0026fh=545px\u0026fw=\u0026ll=\u0026pl=\u0026sq=\u0026r=LYNXMPED5T1R6",
		"publishedAt": "2017-06-30T19:59:38Z",
		"countryName": "United States",
		"description": "Britain's Northern Ireland minister said he still believes a successful conclusion is possible in talks to restore power-sharing in the province, but that the period without devolved government cannot continue for much longer.",
		"summary": "DUBLIN Britain's Northern Ireland minister said he still believes a successful conclusion is possible in talks to restore power-sharing in the province, but that the period without devolved government cannot continue for much longer.",
		"agencyName": "Reuters",
		"countryId": "us",
		"title": "Northern Irish political paralysis can't last for much longer, Britain warns",
		"content": "DUBLIN Britain's Northern Ireland minister said he still believes a successful conclusion is possible in talks to restore power-sharing in the province, but that the period without devolved government cannot continue for much longer.Britain granted politicians a few days for more talks after they missed a deadline to reach an agreement on Thursday and James Brokenshire said he will address parliament in London on Monday with \"what the next steps might be.\"\"I remain of the view that (an agreement) continues to be possible but ... we've had an extended period where Northern Ireland has not had politicians making decisions. That cannot continue for much longer,\" Brokenshire told BBC radio.   (Reporting by Padraic Halpin; editing by John Stonestreet)",
		"category": "general",
		"url": "http://www.reuters.com/article/us-nireland-politics-idUSKBN19L2S4"
	}, {
		"_id": {
			"$oid": "5957718688dba027cc311c12"
		},
		"author": "Ian Graham",
		"name": "karthick",
		"others": [{
			"title": "Tens of thousands march in London to demand Theresa May's resignation",
			"agencyName": "Independent",
			"publishedAt": "2017-07-01T17:41:41Z",
			"url": "http://www.independent.co.uk/news/uk/home-news/tens-of-thousands-march-protest-not-one-more-day-london-oppose-theresa-may-austerity-a7818206.html",
			"author": "May Bulman"
		}, {
			"title": "Theresa May: I want to carry on as Prime Minister for five years to 2022",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-03T19:36:31Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/03/theresa-may-want-carry-prime-minister-five-years-2022/",
			"author": null
		}, {
			"title": "Theresa May is in a mess because she isn't a proper Brexiteer. The next Prime Minister must be",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-17T18:22:35Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/17/theresa-may-mess-isnt-proper-brexiteer-next-prime-minister-must/",
			"author": null
		}, {
			"title": "Theresa May's first year in Number 10: How her fall in popularity compares to former Prime Ministers",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-13T07:00:23Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/13/theresa-mays-first-year-number-10-fall-popularity-compares-former/",
			"author": null
		}, {
			"title": "Theresa May seeks David Cameron's advice as Prime Minister prepares to slap down her Cabinet ministers",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-17T22:00:18Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/17/theresa-may-seeks-david-camerons-advice-prime-minister-prepares/",
			"author": null
		}],
		"keywords": ["marched", "minister", "people", "united", "kingdom", "rest", "marriage", "legalizing", "ireland", "theresa", "blocked", "join", "saturday", "demand", "thousands", "british", "northern", "same-sex", "key", "may", "step", "belfast", "region", "ally", "party", "prime", "largest"],
		"agencyId": "reuters",
		"urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02\u0026d=20170701\u0026t=2\u0026i=1191276922\u0026w=\u0026fh=545px\u0026fw=\u0026ll=\u0026pl=\u0026sq=\u0026r=LYNXMPED602KI",
		"publishedAt": "2017-07-01T16:38:14Z",
		"countryName": "United States",
		"description": "Thousands of people marched in Belfast on Saturday to demand Northern Ireland join the rest of the United Kingdom in legalizing same-sex marriage, a step blocked by the region's largest party, a key ally of British Prime Minister Theresa May.",
		"summary": "BELFAST Thousands of people marched in Belfast on Saturday to demand Northern Ireland join the rest of the United Kingdom in legalizing same-sex marriage, a step blocked by the region's largest party, a key ally of British Prime Minister Theresa May. ",
		"agencyName": "Reuters",
		"countryId": "us",
		"title": "Thousands march for same-sex marriage in Northern Ireland",
		"content": "BELFAST Thousands of people marched in Belfast on Saturday to demand Northern Ireland join the rest of the United Kingdom in legalizing same-sex marriage, a step blocked by the region's largest party, a key ally of British Prime Minister Theresa May. The Democratic Unionist Party, one of the most socially conservative in Europe, has repeatedly blocked gay marriage despite opinion polls in recent years showing a majority in Northern Ireland are in favor of it. \"It's ridiculous that we're treated differently to everyone else in these islands,\" said Belfast resident Sarah, who was at the march with her partner Toni.\"The DUP Dinosaurs are denying us equality and our human rights,\" she added, declining to give her surname. They joined thousands of demonstrators who marched through central Belfast waving rainbow flags and banners saying \"Love is a Human Right.\"The march follows a vote by the German parliament on Friday to legalize same-sex marriage.The Republic of Ireland, long one of the most socially conservative countries in Europe, backed gay marriage in a referendum in 2015. The social policies of the DUP have been put in the spotlight by its deal this week for its 10 members of parliament to support May's government, which failed to secure a majority in a snap election.On Thursday, her Conservative Party was forced to agree to make funds available for abortions in England for women arriving from Northern Ireland in order to secure backing from the British parliament for her policy program. Northern Ireland has some of the most restrictive abortion laws in the European Union and the DUP is against easing access. The DUP has blocked same-sex marriage using a veto meant to protect Northern Ireland's religious communities, but DUP assembly member Christopher Stalford said on Friday he did not know whether the party would be able to keep using the veto in the wake of a poor showing in regional elections in March.Supporters of gay marriage have not had a chance to test the DUP's weakened position yet as the DUP and the second-largest party, Irish nationalist Sinn Fein, have so-far failed to reach an agreement on forming a power-sharing government. Sinn Fein, which has drawn parallels between efforts to secure equality for its Irish Catholic supporters and equality for the gay community, is trying to secure agreement to legalize same-sex marriage as part of the negotiations. Human rights violations of Catholics helped fuel three decades of violence in Northern Ireland between Irish nationalists seeking a united Ireland and mainly Protestant unionists who wanted Northern Ireland to remain British. \"I see parallels with 25 years ago and sectarianism when we thought Catholics and Protestants were a different species,\" said Reverend Charles Kenny, a Church of Ireland rector from Belfast, who took part in the march. \"We have come a long way on that now and should on marriage equality.\" (Writing by Conor Humphries; Editing by Helen Popper)",
		"category": "general",
		"url": "http://www.reuters.com/article/us-nireland-gaymarriage-idUSKBN19M3LM"
	}, {
		"_id": {
			"$oid": "5957718988dba027cc311c13"
		},
		"author": "Reuters Editorial",
		"name": "karthick",
		"others": [{
			"title": "No deal to restore powersharing in Ireland by Monday, Gerry Adams says",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-01T16:12:22Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/01/no-deal-restore-powersharing-ireland-monday-gerry-adams-says/",
			"author": null
		}, {
			"title": "DUP and Sinn Féin close to Northern Ireland power-sharing deal",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-06-30T17:06:32Z",
			"url": "https://www.theguardian.com/uk-news/2017/jun/30/dup-and-sinn-fein-close-to-northern-ireland-power-sharing-deal",
			"author": "Henry McDonald"
		}, {
			"title": "Day 1: Curry gets huge deal, Hayward hears Heat sales pitch",
			"agencyName": "Associated Press",
			"publishedAt": "2017-07-01T22:45:33Z",
			"url": "https://apnews.com/fbc0f34a62984f24aa377bec71e050f8",
			"author": "TIM REYNOLDS"
		}, {
			"title": "President Trump Says U.S. Is Renegotiating Trade Deal With South Korea",
			"agencyName": "Time",
			"publishedAt": "2017-06-30T16:35:33Z",
			"url": "http://time.com/4841875/donald-trump-south-korea-trade-deal/",
			"author": "Matthew Pennington / AP"
		}, {
			"title": "Voters 'sick of politics', Turnbull says after days of infighting",
			"agencyName": "ABC News (AU)",
			"publishedAt": "2017-06-30T23:45:55Z",
			"url": "http://www.abc.net.au/news/2017-07-01/malcolm-turnbull-says-it-is-a-time-for-builders-not-wreckers/8669754",
			"author": "http://www.abc.net.au/news/5511636"
		}],
		"keywords": ["next", "unlikely", "northern", "saturday", "deal", "sinn", "adams", "restore", "days", "said", "province", "power-sharing", "president", "agreement", "reach", "parties", "political", "fein", "ireland", "gerry"],
		"agencyId": "reuters",
		"urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02\u0026d=20170701\u0026t=2\u0026i=1191276911\u0026w=\u0026fh=545px\u0026fw=\u0026ll=\u0026pl=\u0026sq=\u0026r=LYNXMPED602MC",
		"publishedAt": "2017-07-01T16:38:14Z",
		"countryName": "United States",
		"description": "Sinn Fein President Gerry Adams said on Saturday that Northern Ireland's political parties were unlikely to reach a deal to restore the province's power-sharing agreement in the next few days.",
		"summary": "BELFAST Sinn Fein President Gerry Adams said on Saturday that Northern Ireland's political parties were unlikely to reach a deal to restore the province's power-sharing agreement in the next few days. ",
		"agencyName": "Reuters",
		"countryId": "us",
		"title": "Northern Ireland power-sharing deal unlikely in coming days, Sinn Fein says",
		"content": "BELFAST Sinn Fein President Gerry Adams said on Saturday that Northern Ireland's political parties were unlikely to reach a deal to restore the province's power-sharing agreement in the next few days. The region has been locked in a political crisis since January's collapse of the coalition between pro-British unionists and Irish nationalists mandated under a 1998 peace deal that ended three decades of sectarian violence.The British government last week said last week it would give the parties a few more days to agree a way to restore the executive after the latest deadline passed without a deal. Britain's minister for Northern Ireland, James Brokenshire, is due to update parliament on Monday.\"I think it is very unlikely that there will be an agreement by Monday,\" Adams said in a statement.If power-sharing is not restored, Northern Ireland risks reverting to direct rule from London for the first time in a decade, a step backwards in the delicate balance between mainly Catholic Irish nationalists seeking union with Ireland and predominantly Protestant unionists who want to stay in the United Kingdom.Adams said a deal was still possible but there had been no sense of urgency around getting an agreement with the pro-British Democratic Unionist Party (DUP), now a key ally of British Prime Minister Theresa May's minority government.He said no agreement had been reached on republican demands to give the Irish language legal status in the province, a bill of rights and marriage equality.\"The DUP are showing no urgency about dealing with the equality and rights issues,\" said Adams, who joined thousands of people at a march in Belfast to demand Northern Ireland join the rest of the United Kingdom in legalizing same-sex marriage.The social policies of the DUP have been put in the spotlight by its deal this week for its 10 members of parliament to support May's government, which failed to secure a majority in a snap election. (Reporting by Ian Graham and Conor Humphries; Writing by Andrew MacAskill; Editing by Helen Popper)",
		"category": "general",
		"url": "http://www.reuters.com/article/us-nireland-politics-adams-idUSKBN19M3NJ"
	}, {
		"_id": {
			"$oid": "5958951588dba02d4c4db66f"
		},
		"author": "Jon Stone",
		"name": "karthick",
		"others": [{
			"title": "Scotland and Wales to withhold legislative consent from Theresa May's Brexit Repeal Bill, first ministers say",
			"agencyName": "Independent",
			"publishedAt": "2017-07-13T17:03:52Z",
			"url": "http://www.independent.co.uk/news/uk/politics/brexit-great-repeal-bill-scotland-wales-carwyn-jones-nicola-sturgeon-theresa-may-legislative-consent-a7839706.html",
			"author": "Jon Stone"
		}, {
			"title": "Theresa May hints at firing Cabinet members as she says ‘there is no such thing as an unsackable minister’",
			"agencyName": "Independent",
			"publishedAt": "2017-07-19T15:47:52Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-cabinet-reshuffle-sack-ministers-disloyal-prime-minister-brexit-austerity-leaks-commons-a7849511.html",
			"author": "Rob Merrick"
		}, {
			"title": "Jeremy Corbyn says Theresa May is leading a ‘zombie government’",
			"agencyName": "Independent",
			"publishedAt": "2017-07-14T22:00:43Z",
			"url": "http://www.independent.co.uk/news/uk/politics/jeremy-corbyn-theresa-may-zombie-government-southampton-itchen-bournemouth-west-a7842321.html",
			"author": "Shehab Khan"
		}, {
			"title": "UK trade deal with the US won't make up for Brexit damage, says cabinet minister",
			"agencyName": "Independent",
			"publishedAt": "2017-07-09T13:48:02Z",
			"url": "http://www.independent.co.uk/news/uk/politics/uk-us-trade-deal-brexit-negotiations-david-lidington-donald-trump-theresa-may-g20-andrew-marr-show-a7831621.html",
			"author": "Ben Kentish"
		}, {
			"title": "Theresa May's plans to work with Labour on Brexit will hasten her downfall, Tory ex-ministers say",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-10T17:22:23Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/10/tory-mps-fury-theresa-mays-plans-labour-alliance-brexit-unravels/",
			"author": null
		}],
		"keywords": ["cabinet", "extra", "“bung”", "theresa", "minister", "brexit", "power", "pound", "britain", "stable", "role", "everyone", "deliver", "democratic", "leading", "good", "denied", "keeps", "conservatives’", "campaign", "cash", "may", "gove", "could", "benefit", "would", "conservatives", "“secure", "deal", "whole", "government”", "payment", "unionist", "meant", "billion", "northern", "played", "ireland", "michael", "said", "continue", "party", "£1"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/07/02/10/michael-gove.png",
		"publishedAt": "2017-07-02T09:57:15Z",
		"countryName": "Great Britain",
		"description": "The Conservatives’ £1 billion pound deal with the Democratic Unionist Party is good for the whole of Britain because it keeps the Conservatives in power, Michael Gove has said. The Cabinet minister, who played a leading role in the Brexit campaign, denied that the payment was a “bung” and said everyone would benefit from the extra cash for Northern Ireland because it meant Theresa May could continue to deliver “secure and stable government”.",
		"summary": "The Conservatives’ £1 billion pound deal with the Democratic Unionist Party is good for the whole of Britain because it keeps the Conservatives in power, Michael Gove has said.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Michael Gove says £1 billion ‘bung’ for DUP is good for everyone because it keeps the Tories in power",
		"content": "The Cabinet minister, who played a leading role in the Brexit campaign, denied that the payment was a “bung” and said everyone would benefit from the extra cash for Northern Ireland because it meant Theresa May could continue to deliver “secure and stable government”.“I think there is one only way in which we could have a secure government in this country and that’s with Theresa May as Prime Minister,” he told BBC One’s Andrew Marr Show.“The alternative would have been to allow Jeremy Corbyn to take over, that would have meant higher taxes, and in due course our economy going over a cliff and less money for everyone. “In that sense making sure, not just that Theresa is Prime Minister but that Philip is Chancellor of the Exchequer ensures that we can continue to pursue the policies that are generating growth and bearing down on the deficit.”He argue that the payment was about “strengthening the whole United Kingdom”.Mr Gove, who spent the last year on the backbenches but who was appointed as Environment Secretary after last month’s election, dismissed the suggestion that the deal was a “bung” to the hard-right protestant unionist party.“I think that’s unfair, that’s unfair to the people of Northern Ireland and it’s also unfair to the way in which during this negotiation decisions were taken in the interests of everyone in the United Kingdom,” he said.“Bung, the implication is, it implies that this money is somehow going to the DUP on their own, as though it were a partisan deal. It’s not, it’s about strengthening the whole United Kingdom and helping people in one of its most vulnerable areas.”The Conservatives are governing as a minority but have secured support on supply and confidence – money bills and the Queen’s Speech – from the DUP in exchange for extra public spending in Northern Ireland and extra cash raising powers for the Northern Ireland executive. The party has also pledged to abandon its manifesto policy of paring back pensioners benefits for older pensioners.With support from the DUP the Government has a working majority of 13 when the Speaker is included and Sinn Fein continue not to take their seats. The  Commons maths means that the Conservatives can also win any vote if the DUP abstain and do not vote against them.",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/michael-gove-dup-tories-conservatives-1-billion-deal-in-power-marr-show-brexit-a7819016.html"
	}, {
		"_id": {
			"$oid": "5959e36788dba02ee018c69b"
		},
		"author": "Rob Merrick",
		"name": "karthick",
		"others": [{
			"title": "DUP and Sinn Féin close to Northern Ireland power-sharing deal",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-06-30T17:06:32Z",
			"url": "https://www.theguardian.com/uk-news/2017/jun/30/dup-and-sinn-fein-close-to-northern-ireland-power-sharing-deal",
			"author": "Henry McDonald"
		}, {
			"title": "On not hurting people’s delicate fee-fees",
			"agencyName": "Reddit /r/all",
			"publishedAt": null,
			"url": "http://sursumursa.tumblr.com/post/122859059489/on-not-hurting-peoples-delicate-fee-fees",
			"author": null
		}, {
			"title": "Theresa May 'called David Cameron' to beg for his support on DUP deal",
			"agencyName": "Independent",
			"publishedAt": "2017-07-03T12:05:23Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-david-cameron-dup-deal-support-minority-government-conservative-leader-working-majority-a7820611.html",
			"author": "Harriet Agerholm"
		}, {
			"title": "Daniel Greenfield: America is Not a Nation Ruled by Judges » Politichicks.com",
			"agencyName": "Reddit /r/all",
			"publishedAt": "2017-07-15T14:42:25Z",
			"url": "http://politichicks.com/2017/07/daniel-greenfield-america-not-nation-ruled-judges/",
			"author": "Daniel Greenfield"
		}, {
			"title": "Theresa May's £1billion DUP deal faces High Court challenge",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-09T18:08:31Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/09/theresa-mays-1billion-dup-deal-faces-high-court-challenge/",
			"author": null
		}],
		"keywords": ["fein", "northern", "talks", "murphy", "term", "likely", "democratic", "conservatives", "ireland", "blamed", "westminster", "conor", "another", "stormont", "said", "republican", "power-sharing", "making", "–", "deal", "“emboldened”", "don’t", "crisis", "“we", "failure", "theresa", "sinn", "claimed", "failing", "looms", "party", "spokesman", "”", "restore", "dup", "less", "compromise", "propping", "claim", "came", "think", "unionist", "short", "confirmed", "may’s"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/01/13/breaking.jpg",
		"publishedAt": "2017-07-03T12:45:54Z",
		"countryName": "Great Britain",
		"description": "Sinn Fein has blamed Theresa May’s deal with the Democratic Unionist Party for the failure to restore power-sharing in Northern Ireland, as another crisis looms. The DUP has been “emboldened” by propping up the Conservatives at Westminster, the Republican party claimed – making it less likely to compromise at Stormont. The claim came as Sinn Fein confirmed the talks were failing. “We don’t think its likely there will be a deal in the short term,” said spokesman Conor Murphy.",
		"summary": "Sinn Fein has blamed Theresa May’s deal with the Democratic Unionist Party for the failure to restore power-sharing in Northern Ireland, as another crisis looms.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Theresa May's DUP deal to blame for new power-sharing crisis, Sinn Fein says",
		"content": "The DUP has been “emboldened” by propping up the Conservatives at Westminster, the Republican party claimed – making it less likely to compromise at Stormont.The claim came as Sinn Fein confirmed the talks were failing. “We don’t think its likely there will be a deal in the short term,” said spokesman Conor Murphy.Later today, the Northern Ireland Secretary will announce the Government’s next steps after last week’s original deadline for restored power sharing came and went.James Brokenshire may set yet another deadline for a talks, which have continued for months, call this year's second snap assembly election - or re-impose some form of direct rule from Westminster.With the start of the annual marching season just nine days away – when talks will almost certainly be suspended anyway – Mr Brokenshire’s options are narrowing.Unless the Northern Ireland executive is restored, the British government is expected to distribute the £1bn it has promised to the DUP in what is widely seen as a “bung”.The key stumbling block appears to be the DUP’s refusal to agree to a stand-alone Irish Language Act, putting Gaelic on an equal par in law to English.Fearing criticism from more hardline unionists, the DUP is insisting on an all-embracing Culture Act, that would also guarantee the rights of Ulster Scots speakers.Interviewed in Belfast, Mr Murphy said: “The DUP have yet to address the equality and the rights issues which caused these institutions to go down in the first place.“They oppose rights for Irish Language speakers , they oppose rights for ethnic minorities and women. They oppose rights of lesbian and gay citizens to equal marriage.“In doing all of this, they are emboldened by their alliance with the British government, which has taken that in its own interests and against the interests of what needs to happen in this part of Ireland.”Mr Murphy hinted that he expected Mr Brokenshire to extend the deadline a second time, suggesting this afternoon would bring a “holding statement”.He pointed out that the marching season, starting on 12 July, would make the atmosphere “too hostile for political negotiations”.The negotiations to restore power-sharing had been “interrupted twice by the British government” – first for the general election and then to strike a deal with the DUP.The devolved institutions imploded in January when DUP leader Arlene Foster was forced from office after Sinn Fein's then deputy first minister, the late Martin McGuinness, quit.That was in protest at the DUP's handling of the renewable heat incentive (RHI), a scheme that left the administration facing a £490 million overspend.On the issue of language, the DUP has insisted it already supported Irish medium school education during years of devolved government and accused Sinn Fein of politicising its use.",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-dup-deal-power-sharing-sinn-fein-crisis-direct-rule-a7820846.html"
	}, {
		"_id": {
			"$oid": "595a1d2a88dba02ee018c964"
		},
		"author": "Tom Peck",
		"name": "karthick",
		"others": [{
			"title": "DUP and Sinn Féin close to Northern Ireland power-sharing deal",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-06-30T17:06:32Z",
			"url": "https://www.theguardian.com/uk-news/2017/jun/30/dup-and-sinn-fein-close-to-northern-ireland-power-sharing-deal",
			"author": "Henry McDonald"
		}, {
			"title": "Daniel Greenfield: America is Not a Nation Ruled by Judges » Politichicks.com",
			"agencyName": "Reddit /r/all",
			"publishedAt": "2017-07-15T14:42:25Z",
			"url": "http://politichicks.com/2017/07/daniel-greenfield-america-not-nation-ruled-judges/",
			"author": "Daniel Greenfield"
		}, {
			"title": "British PM Theresa May wins confidence vote in parliament - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-06-29T23:31:00Z",
			"url": "http://timesofindia.indiatimes.com/world/uk/british-pm-may-wins-confidence-vote-in-parliament/articleshow/59375396.cms",
			"author": null
		}, {
			"title": "Furious Tory MPs demand party chairman step down as row over 'terrible' election result continues",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-14T22:00:19Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/14/furious-tory-mps-demand-party-chairman-step-row-terrible-election/",
			"author": null
		}, {
			"title": "The government is about to give itself powers to scrap your rights without a vote in parliament. Labour has vowed to fight them",
			"agencyName": "Independent",
			"publishedAt": "2017-07-13T07:26:24Z",
			"url": "http://www.independent.co.uk/news/uk/politics/labour-brexit-repeal-bill-vote-against-theresa-may-changes-keir-starmer-jeremy-corbyn-leave-eu-a7838516.html",
			"author": "Rob Merrick"
		}],
		"keywords": ["servants", "“remains", "deadline", "fein", "northern", "today", "since", "made”", "democratic", "march", "continue", "ireland", "reached", "said", "“civil", "warned", "thursday", "power-sharing", "james", "making", "extended", "–", "running", "deal", "mr", "out”", "election", "“progress", "“time", "sinn", "could", "party", "decisions", "secretary", "achievable”", "politicians", "hiatus", "ireland”", "4pm", "brokenshire", "unionist", "confirmed", "indefinitely"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/13/14/james-brokenshire.jpg",
		"publishedAt": "2017-07-03T16:43:30Z",
		"countryName": "Great Britain",
		"description": "Northern Ireland Secretary James Brokenshire has confirmed that no power-sharing deal has been reached in Northern Ireland. Thursday's deadline had been extended to 4pm today. Mr Brokenshire said “progress had been made” between Sinn Fein and the Democratic Unionist Party and that a deal “remains achievable” but warned that “time is running out”. Mr Brokenshire said that since the election in March, “civil servants not politicians have been making decisions in Northern Ireland” – a hiatus he said could not continue indefinitely.",
		"summary": "Northern Ireland Secretary James Brokenshire has confirmed that no power-sharing deal has been reached in Northern Ireland.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Parliament may have to step in to approve Northern Ireland budget afte",
		"content": "Thursday's deadline had been extended to 4pm today. Mr Brokenshire said “progress had been made” between Sinn Fein and the Democratic Unionist Party and that a deal “remains achievable” but warned that “time is running out”.Mr Brokenshire said that since the election in March, “civil servants not politicians have been making decisions in Northern Ireland” – a hiatus he said could not continue indefinitely.He said the Westminster Government may have to step in to allow money to be spent.He also said the Government intended to  bring forward legislation forcing Northern Ireland parties to declare the sources of their funding from 1 July 2017. Sinn Fein currently receives large donations from foreign donors, particularly in the US, an arrangement that is outlawed for UK political parties outside Northern Ireland.As Mr Brokenshire spoke at Westminster, the main parties at Stormont continued to blame each other for the impasse.DUP leader Arlene Foster claimed Sinn Fein was more concerned with adding to its “shopping list” of demands rather than seeking compromises to restore power-sharing.Ms Foster said her party wanted to see devolution up and running again but was not prepared to sign off on a one-sided deal that would leave the unionist community feeling “short-changed”.“Sinn Fein have a shopping list, a shopping list that seems to get longer every time we meet with them,” she said.“That is very disappointing for all of the people of Northern Ireland, who make it very clear to us that they want to see devolution back up and running again on a fair and proportionate basis.”She added: “The onus is really on Sinn Fein now. Whether they want to continue with this political grandstanding or whether they want to get back to the job of work that we need to do.“I think it's long past the time when we should be back in government.”Earlier, Sinn Fein negotiator Conor Murphy again accused the DUP of refusing to budge on a series of outstanding disputes.The republican party is demanding DUP movement on a proposed Irish Language Act; a bill of rights for the region; legalisation of same sex marriage; and measures dealing with the legacy of the Troubles.“We don't see any urgency in terms of the DUP approach to this and we don't expect and don't think it is likely that there will be a deal in the short term because there is that lack of urgency,” he said.Reflecting on the upcoming Twelfth of July, the mainstay of the loyal order marching season, he added: “We are in the bizarre situation, I'm sure it’s unique to here, that over the summer time we have to break because the atmosphere becomes too hostile for political negotiations.”Mr Murphy continued: “Now we find ourselves up against the Twelfth of July where the atmosphere becomes so hostile that the DUP are even less likely to move on some of these issues.”In regard to the Irish language, Mrs Foster said her party was willing to support proposals that would find favour among the majority of Gaelic speakers.She claimed Sinn Fein was pressing for much more, accusing the party of wanting to assert \"cultural supremacy\" over other sections of the community.Mr Brokenshire said progress had been made on language, culture and identity issues but gaps remained between the parties.“The Government remains committed to working with the parties and the Irish government to find a way to close those gaps quickly.“I continue to believe that a deal remains achievable and if agreement is reached I will bring forward legislation to enable an executive to be formed, possibly as early as this week.”He reiterated time was short.“It is six months since a full executive was in place to represent the people of Northern Ireland.“It is civil servants, not politicians, who have made decisions.“Without political direction it is not possible for strategic decisions to be made about priorities in areas such as education and health.\"The devolved institutions imploded in January when Ms Foster was forced from office after Sinn Fein’s then Deputy First Minister, the late Martin McGuinness, quit.That was in protest at the DUP’s handling of the renewable heat incentive (RHI), a scheme that left the administration facing a £490m overspend.One of the main current sticking points is over Sinn Fein's call for an act officially protecting the Irish language.The DUP is prepared to legislate, but only if there are reciprocal protections for Ulster-Scots speakers.",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/northern-ireland-power-sharing-latest-updates-parliament-budget-approve-deadline-dup-commons-a7821451.html"
	}, {
		"_id": {
			"$oid": "595a778988dba02ee018ccf0"
		},
		"author": "Reuters Editorial",
		"name": "karthick",
		"others": [{
			"title": "Intel Job Listing reveals Next Generation Core Architecture plans - The next Sandy Bridge?",
			"agencyName": "Reddit /r/all",
			"publishedAt": null,
			"url": "https://www.overclock3d.net/news/cpu_mainboard/intel_job_listing_reveals_next_generation_core_architecture_plans/1#.WVkG59EzUT4.reddit",
			"author": null
		}, {
			"title": "Forces seek Rs 27 lakh crore over next 5 years for defence projects - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-07-16T03:18:00Z",
			"url": "http://timesofindia.indiatimes.com/india/forces-seek-rs-27-lakh-crore-over-next-5-years-for-defence-projects/articleshow/59613786.cms",
			"author": "Rajat Pandit"
		}, {
			"title": "Tesla says its Model 3 car will go on sale on Friday",
			"agencyName": "Associated Press",
			"publishedAt": "2017-07-03T13:47:46Z",
			"url": "https://apnews.com/9e7afbbfbc234b688032f7c4b37d5bbd",
			"author": ""
		}, {
			"title": "Theresa May asks to stay in No 10 for 'next few years' as she marks one year in Downing Street",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-13T08:34:55Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/13/theresa-may-asks-stay-no-10-next-years-marks-one-year-downing/",
			"author": null
		}, {
			"title": "This autistic man was told he wouldn't last one month in his job - he's now retiring after 28 years",
			"agencyName": "Independent",
			"publishedAt": "2017-07-04T12:58:10Z",
			"url": "http://www.independent.co.uk/news/uk/home-news/autistic-man-told-wouldnt-last-one-month-in-job-retires-after-28-years-shaun-condon-newport-wales-a7822726.html",
			"author": "Rachael Revesz"
		}],
		"keywords": ["cheap", "appetite", "three", "food", "outlets", "go", "ireland", "creating", "plans", "growing", "uk", "franchise", "years", "next", "seeks", "capitalize", "subway", "open", "5", "000", "jobs", "sandwich", "500", "restaurants"],
		"agencyId": "reuters",
		"urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02\u0026d=20170703\u0026t=2\u0026i=1191509177\u0026w=\u0026fh=545px\u0026fw=\u0026ll=\u0026pl=\u0026sq=\u0026r=LYNXMPED621PN",
		"publishedAt": "2017-07-03T23:05:29Z",
		"countryName": "United States",
		"description": "The Subway franchise of sandwich restaurants plans to open a further 500 outlets in the UK and Ireland over the next three years, creating about 5,000 jobs, as it seeks to capitalize on a growing appetite for cheap food on the go.",
		"summary": "LONDON The Subway franchise of sandwich restaurants plans to open a further 500 outlets in the UK and Ireland over the next three years, creating about 5,000 jobs, as it seeks to capitalize on a growing appetite for cheap food on the go.",
		"agencyName": "Reuters",
		"countryId": "us",
		"title": "Subway targets 3,000 UK/Ireland stores by 2020",
		"content": "LONDON The Subway franchise of sandwich restaurants plans to open a further 500 outlets in the UK and Ireland over the next three years, creating about 5,000 jobs, as it seeks to capitalize on a growing appetite for cheap food on the go.Subway, which sells a wide range of freshly made submarine sandwiches, as well as salads, said on Tuesday it was targeting 3,000 stores by 2020, up from 2,500 currently.\"The expansion plans are in response to consumer demand,\" it said.Britain's food-to-go market is forecast to be worth nearly 22 billion pounds ($29 billion) by 2021, up from 16.1 billion pounds in 2016, according to industry research group IGD.    Other major food-to-go specialists in the UK include Pret A Manger and Greggs (GRG.L).Subway is owned by U.S.-based Doctor's Associates Inc, but its stores are all owned and operated by a network of franchisees.Subway shut 359 restaurants in the United States last year amid stiff competition in a highly fragmented fast-food industry.Globally Subway has more than 44,000 outlets in 112 countries from Afghanistan to Zambia.($1 = 0.7713 pounds) (Reporting by James Davey; Editing by Susan Fenton)",
		"category": "general",
		"url": "http://www.reuters.com/article/us-subway-stores-idUSKBN19O2MX"
	}, {
		"_id": {
			"$oid": "595b5ca588dba032e40ad8f4"
		},
		"author": "Reuters Editorial",
		"name": "karthick",
		"others": [{
			"title": "U.S. deficits to jump $248 billion over next two years due to tax shortfall",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-14T22:23:15Z",
			"url": "http://www.reuters.com/article/us-usa-trump-deficit-idUSKBN19Z2I3",
			"author": "Reuters Editorial"
		}, {
			"title": "Singapore June exports rise 8.2 percent year-on-year for first time in two months",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-17T00:56:39Z",
			"url": "http://www.reuters.com/article/us-singapore-economy-exports-idUSKBN1A2010",
			"author": "Reuters Editorial"
		}, {
			"title": "Cuba bounces back from recession in first half of year: minister",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-14T23:51:22Z",
			"url": "http://www.reuters.com/article/us-cuba-assembly-economy-idUSKBN19Z25G",
			"author": "Reuters Editorial"
		}, {
			"title": "China June trade beats expectations as global demand remains strong",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-13T03:47:29Z",
			"url": "http://www.reuters.com/article/us-china-economy-trade-idUSKBN19Y091",
			"author": "Yawen Chen and Ryan Woo"
		}, {
			"title": "Insurers paid out $19.5 billion for natural disasters in first half: Munich Re",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-18T08:15:09Z",
			"url": "http://www.reuters.com/article/us-insurance-disasters-idUSKBN1A30NY",
			"author": "Reuters Editorial"
		}],
		"keywords": ["expected", "narrowed", "said", "shortfall", "corporation", "half", "tuesday", "ireland", "strong", "slightly", "collected", "june", "tax", "first", "less", "thanks", "receipts", "finance", "year", "sharply", "ministry"],
		"agencyId": "reuters",
		"urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png",
		"publishedAt": "2017-07-04T15:35:27Z",
		"countryName": "United States",
		"description": "Ireland collected slightly less tax than expected in the first half of the year, but the shortfall narrowed sharply in June thanks to strong corporation tax receipts, the finance ministry said on Tuesday.",
		"summary": "DUBLIN Ireland collected slightly less tax than expected in the first half of the year, but the shortfall narrowed sharply in June thanks to strong corporation tax receipts, the finance ministry said on Tuesday.",
		"agencyName": "Reuters",
		"countryId": "us",
		"title": "Irish tax collection shortfall narrows further in June",
		"content": "DUBLIN Ireland collected slightly less tax than expected in the first half of the year, but the shortfall narrowed sharply in June thanks to strong corporation tax receipts, the finance ministry said on Tuesday.Ireland's tax collection was 0.5 percent below target in the year to the end of June up from a shortfall of 2.4 percent reported two months earlier, a level that had raised questions about the government's spending plans.The improvement was mainly due to corporation tax, which was 12.5 percent, or 205 million euros, ahead of target in June, one of the most important months of the year for the tax. Corporation tax and VAT were ahead of target in the first six months of the year while receipts from income tax and excise duties were below target. Overall tax revenues were up 4 percent year-on-year by the end of June, improving from the increase of 0.5 percent reported at the end of April.  Ireland's economy has been the best performing in the European Union for the past three years, swelling the tax take in the process. The finance ministry has forecast that tax revenues will grow by 5.2 percent in 2017. With expenditure 1.4 percent less than planned, the exchequer posted a 2.485 billion euro surplus at the end of June, compared with a deficit of 1.14 billion at the same point a year ago, the ministry said.Ireland aims to cut its deficit to 0.4 percent of gross domestic product this year as it moves toward its first balanced budget in a decade. (Reporting by Conor Humphries Editing by Jeremy Gaunt)",
		"category": "general",
		"url": "http://www.reuters.com/article/us-ireland-economy-budget-idUSKBN19P1YV"
	}, {
		"_id": {
			"$oid": "595b67ec88dba032e40ad965"
		},
		"author": "Ben Kentish",
		"name": "karthick",
		"others": [{
			"title": "DUP and Sinn Féin close to Northern Ireland power-sharing deal",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-06-30T17:06:32Z",
			"url": "https://www.theguardian.com/uk-news/2017/jun/30/dup-and-sinn-fein-close-to-northern-ireland-power-sharing-deal",
			"author": "Henry McDonald"
		}, {
			"title": "'Give up religion or face punishment,' says China's Communist Party to its members - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-07-19T09:05:00Z",
			"url": "http://timesofindia.indiatimes.com/world/china/give-up-religion-or-face-punishment-says-chinas-communist-party-to-its-members/articleshow/59660225.cms",
			"author": null
		}, {
			"title": "No deal to restore powersharing in Ireland by Monday, Gerry Adams says",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-01T16:12:22Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/01/no-deal-restore-powersharing-ireland-monday-gerry-adams-says/",
			"author": null
		}, {
			"title": "EU leaders willing to give UK control over immigration to prevent Brexit, Tony Blair says",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-15T00:01:34Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/14/eu-leaders-willing-give-uk-control-immigration-prevent-brexit/",
			"author": null
		}, {
			"title": "Tejashwi rules out quitting, says will go to 'people’s court' - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-07-12T20:42:00Z",
			"url": "http://timesofindia.indiatimes.com/india/tejashwi-rules-out-quitting-says-will-go-to-peoples-court/articleshow/59569721.cms",
			"author": null
		}],
		"keywords": ["brokenshire", "week", "said", "extended", "agreement", "give", "expire", "leader", "arlene", "dup", "last", "ireland", "attempt", "continue", "james", "reached", "summer", "stormont", "northern", "talks", "negotiations", "reach", "foster", "time", "secretary", "parties", "due", "deal", "power-sharing", "restore"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/09/13/arlene-foster-dup.jpg",
		"publishedAt": "2017-07-04T16:53:44Z",
		"countryName": "Great Britain",
		"description": "No deal has been reached to restore Northern Ireland's power-sharing agreement at Stormont and talks will continue over the summer, DUP leader Arlene Foster has said. Negotiations had been due to expire last week but were extended by Northern Ireland Secretary James Brokenshire in an attempt to give the parties more time to reach a deal.",
		"summary": "No deal has been reached to restore Northern Ireland's power-sharing agreement at Stormont and talks will continue over the summer, DUP leader Arlene Foster has said.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "DUP leader Arlene Foster says no deal reached in ongoing Northern Ireland peace talks",
		"content": "Negotiations had been due to expire last week but were extended by Northern Ireland Secretary James Brokenshire in an attempt to give the parties more time to reach a deal.However, Ms Foster, who recently agreed to prop up Theresa May's minority government in Westminster, said no agreement had been reached and suggested the issue may not be resolved until the autumn.\"We are disappointed we don't have an agreement this afternoon\", Ms Foster said. \"We are going to keep working at it through the summer and hopefully we can come to an agreement later on in the year.\"\"We are certainly up for an agreement, we are up for devolution.\"Talks will continue over the summer but at a reduced intensity, with full negotiations likely to resume in the autumn.A number of sticking points between the DUP and Sinn Fein remain, including differences over a possible Irish Language Act that would protect the rights of Irish speakers in Northern Ireland. The DUP has also refused to support calls to legalise same-sex marriage in Northern Ireland.More follows… ",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/northern-ireland-power-sharing-dup-leader-arlene-foster-no-agreement-stormont-sinn-fein-summer-a7823246.html"
	}, {
		"_id": {
			"$oid": "595cd26588dba02ac8f0d364"
		},
		"author": "Maya Oppenheim",
		"name": "karthick",
		"others": [{
			"title": "Vince Cable just said Brexit might never happen",
			"agencyName": "Independent",
			"publishedAt": "2017-07-09T09:56:12Z",
			"url": "http://www.independent.co.uk/news/uk/politics/vince-cable-liberal-democrat-leader-brexit-may-never-happen-a7831526.html",
			"author": "Tom Peck"
		}, {
			"title": "Baby Justin Trudeau meets Canada's prime minister",
			"agencyName": "BBC News",
			"publishedAt": "2017-07-16T08:26:31Z",
			"url": "http://www.bbc.co.uk/news/world-us-canada-40622707",
			"author": "BBC News"
		}, {
			"title": "Trudeau says Trump told him he does not think Canadian steel a tariff target",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-14T22:07:19Z",
			"url": "http://www.reuters.com/article/us-usa-canada-steel-idUSKBN19Z2GS",
			"author": "Reuters Editorial"
		}, {
			"title": "Canadian Prime Minister Justin Trudeau is about to meet Queen Elizabeth II",
			"agencyName": "Newsweek",
			"publishedAt": "2017-07-04T18:14:20Z",
			"url": "http://www.newsweek.com/justin-trudeau-queenj-elizabeth-ii-631812",
			"author": "Josh Lowe"
		}, {
			"title": "UK trade deal with the US won't make up for Brexit damage, says cabinet minister",
			"agencyName": "Independent",
			"publishedAt": "2017-07-09T13:48:02Z",
			"url": "http://www.independent.co.uk/news/uk/politics/uk-us-trade-deal-brexit-negotiations-david-lidington-donald-trump-theresa-may-g20-andrew-marr-show-a7831621.html",
			"author": "Ben Kentish"
		}],
		"keywords": ["stage", "seizing", "increasingly", "elected", "global", "take", "canadian", "trudeau", "approach", "new", "party", "openings", "newly", "becoming", "neighbour", "justin", "advantage", "country", "varadkar", "britain", "taken", "mr", "brexit", "us", "prime", "swipe", "canada", "isolated", "argued", "inward-looking", "took", "respective", "minister", "liberal", "dublin", "leader", "ireland", "ireland’s", "leo", "conference", "aim", "press"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/06/20/justin-trudeau.jpg",
		"publishedAt": "2017-07-05T17:49:59Z",
		"countryName": "Great Britain",
		"description": "Canadian Prime Minister Justin Trudeau has taken a swipe at Britain over Brexit and argued the country is becoming increasingly inward-looking. During a press conference in Dublin with Ireland’s newly elected Prime Minister Leo Varadkar, Mr Trudeau took aim at Britain and the US. The leader of the Liberal Party argued Canada and Ireland should take advantage of their respective neighbour's increasingly isolated approach by seizing new openings on the global stage.",
		"summary": "Canadian Prime Minister Justin Trudeau has taken a swipe at Britain over Brexit and argued the country is becoming increasingly inward-looking.",
		"agencyName": "Independent",
		"countryId": "gb",
		"title": "Justin Trudeau just said what most of us are already thinking about Brexit",
		"content": "During a press conference in Dublin with Ireland’s newly elected Prime Minister Leo Varadkar, Mr Trudeau took aim at Britain and the US.The leader of the Liberal Party argued Canada and Ireland should take advantage of their respective neighbour's increasingly isolated approach by seizing new openings on the global stage.\"There are tremendous opportunities for countries like Canada and Ireland, at a time where perhaps our significant allies and trading partners in the case of both the US and the UK are turning inward or at least turning into a different direction,\" the 45-year-old said.He said the two nations should \"make the pitch” they are places which are “exciting and open to the world in a positive, progressive way.\"Mr Varadkar, the youngest and first openly gay prime minister in the majority-Catholic country, echoed Mr Trudeau’s arguments and restated his country’s commitment to the European Union as it prepares for Britain’s exit from the continent.\"We each share a relationship with a very big neighbour, a neighbour that has to a certain extent decided to go in a different direction at least for the time being,\" he said.The politician, who is a son of an Indian migrant, said it was “unfortunate” Britain had opted to leave the European Union and would be unable to navigate free trade agreements like the one between Canada and the EU until it has formally left the bloc.\"I can't see a scenario where Britain could remain a member of the EU, even in a transitional period, and then negotiate other trade deals on their own,\" he said.The two leaders share clear parallels in the sense that they are both young, progressive and occupy the centre ground. They are also in similarly challenging positions given they both face testing times with their heavyweight neighbours – the US under Donald Trump and Britain’s decision to leave the EU.Mr Trudeau, who is in Ireland for a three-day visit ahead of the G20 meeting in Hamburg later this week, enjoyed some downtime with the Irish PM after their day of meetings.The world leaders both shared photos of their run in Pheonix Park on their Twitter accounts.The sun came out just in time for a quick chance to see more of this beautiful part of Dublin on foot... nice pace @campaignforleo. pic.twitter.com/qQFoMxbJacAfter today's Dail business joined @JustinTrudeau for quick jog through #PhoenixPark. Now off to Dublin Castle for evening business pic.twitter.com/irb1nnmj9IMr Varadkar, who has previously expressed admiration for Mr Trudeau's leadership style, wore Canada-themed socks to the earlier meetings.Mr Trudeau is famed for his sock choice and often wears a special pair for particular occasions, with many dubbing it “sock diplomacy”. The Canadian wore mismatched Star Wars socks to meet Mr Varadkar’s predecessor Enda Kenny in May. It coincided with the widely-celebrated Star Wars Day on 4 May.",
		"category": "general",
		"url": "http://www.independent.co.uk/news/world-0/justin-trudeau-brexit-latest-news-uk-turn-inward-g20-summit-canada-leave-eu-prime-minister-a7824561.html"
	}, {
		"_id": {
			"$oid": "595cd8de88dba02ac8f0d3b5"
		},
		"author": null,
		"name": "karthick",
		"others": [{
			"title": "I just took one, just one step outside my house and took this. (Northern California) • r/sidj2025blog",
			"agencyName": "Reddit /r/all",
			"publishedAt": "2017-06-30T17:15:34+00:00",
			"url": "https://www.reddit.com/r/sidj2025blog/comments/6khbbp/i_just_took_one_just_one_step_outside_my_house/",
			"author": "rollupdatrollup"
		}, {
			"title": "Donald Trump watches (and re-watches) CNN like football game tape, critiquing his aides",
			"agencyName": "Newsweek",
			"publishedAt": "2017-07-14T15:16:42Z",
			"url": "http://www.newsweek.com/donald-trump-vs-cnn-president-watches-cable-news-football-gametape-636820",
			"author": "Tim Marcin"
		}, {
			"title": "Watch",
			"agencyName": "Reddit /r/all",
			"publishedAt": null,
			"url": "https://500px.com/photo/219665737/watch-by-linksphotograph",
			"author": null
		}, {
			"title": "Local residents hold silent walk around Grenfell Tower",
			"agencyName": "Independent",
			"publishedAt": "2017-07-14T20:51:38Z",
			"url": "http://www.independent.co.uk/news/uk/home-news/grenfell-tower-local-residents-silent-walk-a7842216.html",
			"author": "Shehab Khan"
		}, {
			"title": "Wales and Scotland offer free abortions to women from Northern Ireland",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-07-04T16:08:28Z",
			"url": "https://www.theguardian.com/world/2017/jul/04/wales-scotland-offer-free-abortions-northern-irish-women",
			"author": "Jessica Elgot"
		}],
		"keywords": ["awoken", "local", "rudely", "seal", "ireland", "coast", "northern"],
		"agencyId": "the_telegraph",
		"urlToImage": "http://www.telegraph.co.uk/content/dam/video_previews/r/y/ryymr0yje6xlt6g2mq3kmolozwuwrwcy-xlarge.jpg",
		"publishedAt": "2017-07-05T20:11:38Z",
		"countryName": "Great Britain",
		"description": "A seal is rudely awoken by a local just off the coast of Northern Ireland.",
		"summary": "",
		"agencyName": "The Telegraph",
		"countryId": "gb",
		"title": "Watch: Cheeky seal lounges around in rubber dinghy",
		"content": "",
		"category": "general",
		"url": "http://www.telegraph.co.uk/news/2017/07/05/watchcheeky-seal-lounges-around-rubber-dinghy/"
	}, {
		"_id": {
			"$oid": "596120b088dba01834acacf7"
		},
		"author": "By Fraser Mackie For Mailonline",
		"name": "karthick",
		"others": [{
			"title": "Celtic full-back Dedryck Boyata a doubt for Champions League opener",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-05T00:14:44Z",
			"url": "http://www.dailymail.co.uk/sport/rugbyunion/article-4665812/Mako-Vunipola-start-Lions-against-New-Zealand.html",
			"author": "By Stephen Mcgowan For The Scottish Daily Mail"
		}, {
			"title": "Linfield 0-2 Celtic: Sinclair and Rogic strikes give Rodgers' men win",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-14T18:58:57Z",
			"url": "http://www.dailymail.co.uk/sport/football/article-4697624/Linfield-0-2-Celtic-Sinclair-Rogic-strike-Hoops.html",
			"author": "By Ben Grounds For Mailonline"
		}, {
			"title": "Liverpool boss Jurgen Klopp wants fans to dream of the Premier League",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-18T08:12:10Z",
			"url": "http://www.dailymail.co.uk/sport/football/article-4706046/Liverpool-boss-Klopp-wants-fans-dream-Premier-League.html",
			"author": "By Mike Keegan For Mailonline"
		}, {
			"title": "African Champions League group A results and standings",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-06-30T19:57:29Z",
			"url": "http://www.dailymail.co.uk/wires/reuters/article-4655600/African-Champions-League-group-A-results-standings.html",
			"author": "By Reuters"
		}, {
			"title": "African Champions League group C results and standings",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-01T14:57:30Z",
			"url": "http://www.dailymail.co.uk/wires/reuters/article-4657160/African-Champions-League-group-C-results-standings.html",
			"author": "By Reuters"
		}],
		"keywords": ["1988", "ireland", "age", "playing", "14", "schoolboy", "since", "windsor", "rodgers", "brendan", "park", "northern", "international", "visited", "brazil"],
		"agencyId": "daily_mail",
		"urlToImage": "http://i.dailymail.co.uk/i/pix/2017/07/09/01/4226C02F00000578-0-image-a-98_1499561663127.jpg",
		"publishedAt": "2017-07-09T00:58:48Z",
		"countryName": "Great Britain",
		"description": "Brendan Rodgers has not visited Windsor Park since playing a schoolboy international for Northern Ireland against Brazil in 1988 at the age of 14.",
		"summary": "Celtic’s Linfield tie cannot be any more troublesome than last year’s qualifiers ; Trips to Gibraltar, Kazakhstan and Israel last term mean Belfast visit is short hop ; Former Liverpool manager hasn't been back to Windsor Park since he was 14 ; Says vital Champions League game in Northern Ireland has 'nice little edge to it'  ",
		"agencyName": "Daily Mail",
		"countryId": "gb",
		"title": "Celtic boss Brendan Rodgers plays down Champions League trip",
		"content": "Brendan Rodgers has not visited Windsor Park since playing a schoolboy international for Northern Ireland against Brazil in 1988 at the age of 14.On Friday, he returns as Celtic manager arguing that, for all the religious and historical sensitivities surrounding the fixture, the trip will be a delight compared to last season’s Champions League qualifying adventures.After Gibraltar, Kazakhstan and Israel en route to the group stage, Rodgers is happy to regard the Belfast bear pit expected to greet the Scottish champions as a bonus.An environment to sharpen the focus on the opening competitive contest of the season. A game with ‘a nice little edge to it’, as Rodgers euphemistically described the tie.There can be no place on planet football where Celtic will feel less welcome in the eyes of the home supporters.Yet the ultimate managerial prize-winner for positivity, Rodgers insists the hop across to face Linfield without the backing of a single Celtic fan is one that will only aid his group to come together in the face of hostility.When asked if this was the ideal tie logistically for him to set off on the Champions League road, the County Antrim-raised boss said: ‘Straight away that was my feeling.‘When you think that last year we were away in the heat of Gibraltar where it was 35 degrees, then we were out to Astana and then Hapoel Be’er Sheva. This is a home from home, really.‘We’re staying in a lovely hotel and Belfast is a great city. We’re playing in the national stadium and it’s a very, very short flight.‘So, in terms of all the logistics and all that side of it, and in terms of preparation for the team, it’s all cool. I haven’t seen the revamped stadium so I’m looking forward to it.‘You always have to respect the opponent. You always have to respect the atmosphere. There will be a nice little edge to it. It’ll get us focused on the game and, over the two legs, we have to get through.‘A big part of my job last year was to go and prepare the team mentally for how to deal with big occasions and big games. How to keep that calmness and that focus.‘You want to go and play in a passionate stadium. It gives you the chance as a team, as a group, to bond even tighter together. To have that oneness that you need.‘Then, when a question is put to you in the game, which there usually is, it’s not about how each individual plays. It’s about how the team plays.‘Do they have that resilience and that mentality? That’s something that we’ve built up over the last period of time.’Rodgers is now confident about taking his Treble-winning team back into the European stage.To think that 12 months ago he led out his players into the searing sun and on to a dreadful surface to meet with humiliation on his Celtic bow against Lincoln Red Imps.Ministry of Defence police officer Lee Casciaro got the better of Efe Ambrose to create the 1-0 shock, which was overturned by three goals a week later.The feeling of assurance from the manager approaching this term’s Champions League opener could not be in greater contrast, according to Rodgers, even without injured defender Dedryck Boyata.He said: ‘Yeah, I enjoy watching the team now. They were good guys last year, good boys, but we were a long way from where I would consider them to be a team.‘Now, firstly, fundamentally they can defend. And they want to defend. They defend forwards, they are aggressive. They no longer defend with their eyes, they defend with physicality.‘They press, they get up to people. Then they play football. They are good to watch and the numbers prove that.‘It’s still very early on in the season, they are still getting fitter and stronger. We won’t be perfect, but we go to fight to get into the next round.‘And, yeah, there’s a day and night difference on last year and we’re in a good place.’Rodgers has already cast his eye over three Linfield matches, including the two legs in which David Healy’s side inched past San Marino’s La Fiorita in the previous round.‘We respect them and will not take them lightly,’ said Rodgers. ‘They’ll fight, run and work. I’ve been to many grounds with hostility before — but you always have some supporters.‘Listen, it’s hostile at places like Ibrox, Old Trafford and Goodison Park. The most important objective for us is to win. The surrounding stuff doesn’t concern me.’ ",
		"category": "entertainment",
		"url": "http://www.dailymail.co.uk/sport/champions_league/article-4678656/Celtic-boss-Brendan-Rodgers-plays-Windsor-Park-trip.html"
	}, {
		"_id": {
			"$oid": "5961cfd988dba01834acaf2e"
		},
		"author": "Nicola Oakley",
		"name": "karthick",
		"others": [{
			"title": "DUP and Sinn Féin close to Northern Ireland power-sharing deal",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-06-30T17:06:32Z",
			"url": "https://www.theguardian.com/uk-news/2017/jun/30/dup-and-sinn-fein-close-to-northern-ireland-power-sharing-deal",
			"author": "Henry McDonald"
		}, {
			"title": "Rupert Murdoch's papers criticize Trump; is the mogul sending a message?",
			"agencyName": "CNN",
			"publishedAt": "2017-07-18T09:12:06Z",
			"url": "http://money.cnn.com/2017/07/18/media/rupert-murdoch-president-trump-editorials/index.html",
			"author": "Brian Stelter"
		}, {
			"title": "Etihad says flyers can carry electronic on board US flights from Abu Dhabi - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-07-02T20:56:00Z",
			"url": "http://timesofindia.indiatimes.com/world/middle-east/etihad-says-flyers-can-carry-electronic-on-board-us-flights-from-abu-dhabi/articleshow/59412961.cms",
			"author": "Saurabh Sinha"
		}, {
			"title": "Real Madrid send Man Utd message over Gareth Bale transfer",
			"agencyName": "Metro",
			"publishedAt": "2017-06-27T12:50:26Z",
			"url": "http://metro.co.uk/2017/06/27/manchester-united-warned-by-real-madrid-that-gareth-bale-is-untouchable-6738089/",
			"author": "https://www.facebook.com/MetroUK"
		}, {
			"title": "Look up! Northern Lights spectacle possible Sunday night",
			"agencyName": "Google News",
			"publishedAt": "2017-07-16T17:36:45Z",
			"url": "http://www.cnn.com/2017/07/16/us/possible-northern-lights-show/index.html",
			"author": "Gisela Crespo, CNN"
		}],
		"keywords": ["ireland", "shared", "message", "sending", "board", "tourism", "positive", "definitely", "northern", "photo"],
		"agencyId": "mirror",
		"urlToImage": "http://i2.mirror.co.uk/incoming/article10764169.ece/ALTERNATES/s1200/Jamie-Dornan-at-the-Irish-Open-Pro-Am.jpg",
		"publishedAt": "2017-07-09T12:54:47Z",
		"countryName": "Great Britain",
		"description": "The photo was shared by the Northern Ireland tourism board and is definitely sending a positive message",
		"summary": "",
		"agencyName": "Mirror",
		"countryId": "gb",
		"title": "Jamie Dornan's 'bulge' is all anyone can look at in this photo",
		"content": "",
		"category": "general",
		"url": "http://www.mirror.co.uk/3am/celebrity-news/jamie-dornans-bulge-anyone-can-10764042"
	}, {
		"_id": {
			"$oid": "5961ecb488dba01834acb04f"
		},
		"author": "Richard Innes",
		"name": "karthick",
		"others": [{
			"title": "Manchester United sign former Chelsea star",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-03T19:44:09Z",
			"url": "http://www.mirror.co.uk/sport/football/news/man-united-sign-former-chelsea-10732259",
			"author": "Jake Polden"
		}, {
			"title": "Manchester United gossip: PSG midfielder lined up by Mourinho?",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-19T04:00:00Z",
			"url": "http://www.mirror.co.uk/sport/football/transfer-news/zlatan-ibrahimovic-manchester-united-news-10826157",
			"author": "Football Spy"
		}, {
			"title": "Manchester United gossip: Roma star to snub United and stay with Giallorossi",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-16T03:58:00Z",
			"url": "http://www.mirror.co.uk/sport/football/transfer-news/manchester-united-transfer-news-rumours-10807012",
			"author": "Football Spy"
		}, {
			"title": "Manchester United 2 Real Madrid 0 as football giants clash in Los Angeles",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-13T06:05:00Z",
			"url": "http://www.mirror.co.uk/sport/football/news/manchester-united-real-madrid-row-10786461",
			"author": "David McDonnell"
		}, {
			"title": "Why a disgraced Catholic priest was housed near Canberra schools",
			"agencyName": "ABC News (AU)",
			"publishedAt": "2017-06-29T23:51:07Z",
			"url": "http://www.abc.net.au/news/2017-06-30/report-reveals-how-former-catholic-priest-was-housed-near-school/8665020",
			"author": "http://www.abc.net.au/news/jesse-dorsett/8009842"
		}],
		"keywords": ["ireland", "path", "taken", "vow", "footballers", "poverty", "former", "northern", "international", "different"],
		"agencyId": "mirror",
		"urlToImage": "http://i4.mirror.co.uk/incoming/article10764713.ece/ALTERNATES/s1200/Phil-Mulryne-of-Manchester-United-in-action.jpg",
		"publishedAt": "2017-07-09T15:14:01Z",
		"countryName": "Great Britain",
		"description": "The former Northern Ireland international has taken a very different path to most footballers, and has now taken a vow of poverty",
		"summary": "",
		"agencyName": "Mirror",
		"countryId": "gb",
		"title": "Former Manchester United midfielder ordained a Roman Catholic priest",
		"content": "",
		"category": "general",
		"url": "http://www.mirror.co.uk/sport/football/news/former-manchester-united-midfielder-phil-10764969"
	}, {
		"_id": {
			"$oid": "59623f3188dba01834acb2e1"
		},
		"author": "Alex Spink",
		"name": "karthick",
		"others": [{
			"title": "Warren Gatland sticks with the 23 Lions who slayed the All Blacks for third Test",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-05T19:16:52Z",
			"url": "http://www.mirror.co.uk/sport/rugby-union/warren-gatland-sticks-23-lions-10745131",
			"author": "Alex Spink"
		}, {
			"title": "British and irish Lions beat 14-man All Blacks in famous victory",
			"agencyName": "Independent",
			"publishedAt": "2017-07-01T11:24:59Z",
			"url": "http://www.independent.co.uk/sport/rugby/rugby-union/lionstour/british-and-irish-lions-vs-all-blacks-score-result-victory-sonny-bill-williams-red-card-tackle-video-a7817941.html",
			"author": "Jack de Menezes"
		}, {
			"title": "North Korea missile test a 'new threat to world', says US amid show of military force",
			"agencyName": "The Guardian (AU)",
			"publishedAt": "2017-07-05T00:32:10Z",
			"url": "https://www.theguardian.com/world/2017/jul/05/north-korea-missile-test-new-threat-world-says-us-military-force-sanctions-workers",
			"author": "Justin McCurry"
		}, {
			"title": "Lions tour ratings: How each of Gatland's players performed during the series",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-09T16:00:00Z",
			"url": "http://www.mirror.co.uk/sport/rugby-union/british-irish-lions-tour-ratings-10764484",
			"author": "Alex Spink"
		}, {
			"title": "Shikhar Dhawan replaces Murali Vijay for Sri Lanka Test series",
			"agencyName": "The Hindu",
			"publishedAt": null,
			"url": "http://www.thehindu.com/sport/cricket/injured-vijay-out-dhawan-comes-in-for-lanka-test-series/article19296054.ece",
			"author": "PTI"
		}],
		"keywords": ["champions", "ireland", "famous", "minutes", "led", "best", "total", "yet", "-", "three", "britain", "world", "still", "forced", "grand", "draw", "tests"],
		"agencyId": "mirror",
		"urlToImage": "http://i3.mirror.co.uk/incoming/article10759454.ece/ALTERNATES/s1200/New-Zealand-v-British-Irish-Lions.jpg",
		"publishedAt": "2017-07-09T21:00:00Z",
		"countryName": "Great Britain",
		"description": "Over three Tests the best of Britain and Ireland led the world champions for the grand total of three minutes - yet still forced a famous draw",
		"summary": "",
		"agencyName": "Mirror",
		"countryId": "gb",
		"title": "Warren Gatland doubts Lions could have drawn series under any other coach",
		"content": "",
		"category": "general",
		"url": "http://www.mirror.co.uk/sport/rugby-union/warren-gatland-doubts-lions-could-10766185"
	}, {
		"_id": {
			"$oid": "59623f3188dba01834acb2e4"
		},
		"author": "Alex Spink",
		"name": "karthick",
		"others": [{
			"title": "China June new home prices rise 0.7 percent month on month, 10.2 percent year on year",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-18T02:53:02Z",
			"url": "http://www.reuters.com/article/us-china-economy-homeprices-idUSKBN1A3077",
			"author": "Reuters Editorial"
		}, {
			"title": "All drugs could be decriminalized in New Zealand if health officials have it their way",
			"agencyName": "Newsweek",
			"publishedAt": "2017-07-05T19:39:56Z",
			"url": "http://www.newsweek.com/new-zealand-drugs-decriminalize-legal-laws-632322",
			"author": "Janice Williams"
		}, {
			"title": "Lions tour ratings: How each of Gatland's players performed during the series",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-09T16:00:00Z",
			"url": "http://www.mirror.co.uk/sport/rugby-union/british-irish-lions-tour-ratings-10764484",
			"author": "Alex Spink"
		}, {
			"title": "Just how late is your train? New data to lift the lid on tardy service",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-18T11:37:38Z",
			"url": "http://www.telegraph.co.uk/business/2017/07/18/just-late-train-new-data-lift-lid-tardy-service/",
			"author": null
		}, {
			"title": "EU wants power to impose huge fines on Britain for years after Brexit",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-17T00:01:16Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/16/eu-wants-power-impose-huge-fines-britain-years-brexit/",
			"author": null
		}],
		"keywords": ["ireland", "roots", "blacks’", "clown", "hold", "betraying", "accused", "46-year", "proud", "way", "best", "britain", "kiwi", "lampooned", "breaking"],
		"agencyId": "mirror",
		"urlToImage": "http://i1.mirror.co.uk/incoming/article10765254.ece/ALTERNATES/s1200/MAIN-Warren-Gatland-paper-showing-him-with-red-nose.jpg",
		"publishedAt": "2017-07-09T21:00:00Z",
		"countryName": "Great Britain",
		"description": "The proud Kiwi was lampooned as a clown and accused of betraying his roots on his way to breaking the All Blacks’ 46-year hold over the best of Britain and Ireland",
		"summary": "",
		"agencyName": "Mirror",
		"countryId": "gb",
		"title": "Gatland lifts the lid on the personal price he paid during tour of New Zealand",
		"content": "",
		"category": "general",
		"url": "http://www.mirror.co.uk/sport/rugby-union/warren-gatland-lifts-lid-personal-10765198"
	}, {
		"_id": {
			"$oid": "596680e76e4e499bdfd0a4ae"
		},
		"author": "By Daniel Roth For Dailymail.com",
		"name": "karthick",
		"others": [{
			"title": "Kirk waits until last minute to reach US Women's Open",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-13T02:12:59Z",
			"url": "http://www.dailymail.co.uk/wires/ap/article-4691480/Kirk-waits-minute-reach-US-Womens-Open.html",
			"author": "By Associated Press"
		}, {
			"title": "American Airlines denies passengers got sick because of toxic farts",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-18T03:14:29Z",
			"url": "http://www.dailymail.co.uk/news/article-4704936/American-Airlines-denies-passengers-got-sick-farts.html",
			"author": "By Dailymail.com Reporter"
		}, {
			"title": "17 \"American\" Foods That People Outside The US Are Super Jealous Of",
			"agencyName": "Buzzfeed",
			"publishedAt": "2017-07-04T20:57:18Z",
			"url": "https://www.buzzfeed.com/terripous/17-american-foods-that-people-outside-the-us-are-super",
			"author": "Terri Pous"
		}, {
			"title": "No, a fart didn't cause an American Airlines flight to evacuate all its passengers",
			"agencyName": "Mashable",
			"publishedAt": "2017-07-17T14:24:02.125Z",
			"url": "http://mashable.com/2017/07/17/passed-gas-american-airlines-flight-evacuation/",
			"author": "Gianluca Mezzofiore"
		}, {
			"title": "Tell Us Your Zodiac Sign And We'll Reveal Which Member Of The \"A\" Team You Are",
			"agencyName": "Buzzfeed",
			"publishedAt": "2017-07-16T03:47:49Z",
			"url": "https://www.buzzfeed.com/amani727/tell-us-your-zodiac-sign-and-well-reveal-which-me-2fnv6",
			"author": "amani727"
		}],
		"keywords": ["publicly", "last", "ridiculing", "week", "american", "carriers", "dublin", "industry", "aviation", "comments", "condemned", "airways", "ireland", "qatar", "members", "us", "head", "strongly"],
		"agencyId": "daily-mail",
		"urlToImage": "http://i.dailymail.co.uk/i/pix/2017/07/12/21/42441E2100000578-0-image-a-2_1499890150659.jpg",
		"publishedAt": "2017-07-12T20:59:55Z",
		"countryName": "Great Britain",
		"description": "Members of the US aviation industry have strongly condemned the comments of the head of Qatar Airways after publicly ridiculing American carriers last week in Dublin, Ireland.",
		"agencyName": "Daily Mail",
		"countryId": "gb",
		"title": "US airline industry rebukes 'chauvinist' Qatar Airway CEO",
		"category": "entertainment",
		"url": "http://www.dailymail.co.uk/news/article-4690610/Chauvinist-CEO-Qatar-Airways-calls-carriers-crap.html"
	}, {
		"_id": {
			"$oid": "5967454b6e4e499bdfd0ab47"
		},
		"author": null,
		"name": "karthick",
		"others": [{
			"title": "Theresa May asks to stay in No 10 for 'next few years' as she marks one year in Downing Street",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-13T08:34:55Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/13/theresa-may-asks-stay-no-10-next-years-marks-one-year-downing/",
			"author": null
		}, {
			"title": "Tony Blair: 'I feel sorry for Theresa May as Tories plot to throw her off the ledge'",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-16T11:30:42Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/16/tony-blair-feel-sorry-theresa-may-tories-plot-throw-ledge/",
			"author": null
		}, {
			"title": "'Too much sun and warm Prosecco' - slap down for Tory MP calling for Theresa May to quit",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-09T11:29:03Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/09/theresa-may-ally-accuses-tory-mps-calling-quit-drinking-much/",
			"author": null
		}, {
			"title": "Theresa May’s tumultuous year",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-13T07:00:23Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/13/theresa-mays-tumultuous-year/",
			"author": null
		}, {
			"title": "Theresa May warns plotting Tory MPs 'it's me or Corbyn'",
			"agencyName": "Independent",
			"publishedAt": "2017-07-18T08:07:15Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-conservative-mps-party-jeremy-corbyn-leader-minority-government-brexit-cabinet-prime-a7846366.html",
			"author": "Rob Merrick"
		}],
		"keywords": ["tale", "fatally", "whose", "best", "exceptional", "ireland", "footballing", "talents", "legend", "undermined", "unshakeable", "george", "drink", "northern", "told", "addiction"],
		"agencyId": "the-telegraph",
		"urlToImage": "http://www.telegraph.co.uk/content/dam/video_previews/o/3/o3ndf3yje6ebjt3brhqvztgx-r8uihpj-xlarge.jpg",
		"publishedAt": "2017-07-13T11:22:36Z",
		"countryName": "Great Britain",
		"description": "There is tale told in Northern Ireland about George Best, the footballing legend whose exceptional talents were fatally undermined by his unshakeable addiction to drink.",
		"agencyName": "The Telegraph",
		"countryId": "gb",
		"title": "One year on, Theresa May feels duty-bound to lead the Tories through the mess she made",
		"category": "general",
		"url": "http://www.telegraph.co.uk/news/2017/07/13/one-year-theresa-may-feels-duty-bound-lead-tories-mess-made/"
	}, {
		"_id": {
			"$oid": "596754b66e4e499bdfd0ac04"
		},
		"author": "Jennifer Duggan / Dublin",
		"name": "karthick",
		"others": [],
		"keywords": ["described", "collins", "would", "michael", "like", "become", "light", "ireland", "shining", "unto", "world"],
		"agencyId": "time",
		"urlToImage": "https://timedotcom.files.wordpress.com/2017/07/hk_g1520_irishpm.jpg?w=720",
		"publishedAt": "2017-07-13T11:53:19Z",
		"countryName": "United States",
		"description": "\"I would like Ireland to become what Michael Collins described as the shining light unto the world\"",
		"agencyName": "Time",
		"countryId": "us",
		"title": "Q\u0026amp;A: Ireland's Leo Varadkar on Brexit, Trump and Keeping Ireland 'At the Center of the World'",
		"category": "general",
		"url": "http://time.com/4856193/ireland-leo-varadkar-interview-brexit-trump/"
	}, {
		"_id": {
			"$oid": "5967d41e6e4e49c17d82c7e0"
		},
		"author": "talkSPORT",
		"name": "karthick",
		"others": [],
		"keywords": ["mcgeady", "immediate", "joins", "club", "republic", "speaks", "three-year", "deepdale", "everton", "double", "fans", "website:", "hope", "deal", "manager", "boss", "james", "performer", "ireland", "official", "return", "league", "simon", "told", "volumes", "loan", "last", "given", "worked", "grayson", "impressed", "signing", "offer", "spell", "season", "vaughan", "premier", "championship", "sunderland", "new", "announced", "outstanding", "career", "exceptional", "winger", "player", "aiden", "preston"],
		"agencyId": "talksport",
		"urlToImage": "http://talksport.com/sites/default/files/field/image/201707/674754260.jpg",
		"publishedAt": "2017-07-13T20:25:39Z",
		"countryName": "Great Britain",
		"description": "Sunderland have announced the double signing of Aiden McGeady and James Vaughan. Republic of Ireland winger McGeady joins from Everton on a three-year deal and, given how he impressed for Preston in the Championship last season, will offer Sunderland fans hope of an immediate return to the Premier League. McGeady worked with new boss Simon Grayson during his loan spell at Deepdale, and the manager told his club's official website: \"Aiden's career speaks volumes. He's been an exceptional player and was an outstanding performer at Preston last season.\"",
		"title": "Double swoop! Sunderland sign winger Aiden McGeady and forward James Vaughan",
		"countryId": "gb",
		"agencyName": "TalkSport",
		"category": "sport",
		"url": "http://talksport.com/football/double-swoop-sunderland-sign-winger-aiden-mcgeady-and-forward-james-vaughan-170713246637"
	}, {
		"_id": {
			"$oid": "596926906e4e49c17d82d54a"
		},
		"author": "Adam Lusher",
		"name": "karthick",
		"others": [{
			"title": "Middle-class children 'being groomed to sell drugs'",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-14T00:01:33Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/13/middle-class-children-groomed-sell-drugs/",
			"author": null
		}, {
			"title": "Police officer seriously injured after arrest of teen allegedly turns violent",
			"agencyName": "ABC News (AU)",
			"publishedAt": "2017-07-03T20:46:32Z",
			"url": "http://www.abc.net.au/news/2017-07-04/police-officer-in-serious-condition-after-teen-arrest-goes-wrong/8675594",
			"author": null
		}, {
			"title": "The shocking inequality between the South-east of England and the rest revealed",
			"agencyName": "Independent",
			"publishedAt": "2017-07-18T23:00:18Z",
			"url": "http://www.independent.co.uk/news/uk/home-news/average-income-regional-variation-inequality-poverty-wages-salary-institute-fiscal-studies-a7847261.html",
			"author": "David Hughes"
		}, {
			"title": "Small-town children at risk of exploitation by criminal gangs, say MPs",
			"agencyName": "The Guardian (UK)",
			"publishedAt": "2017-07-13T23:00:07Z",
			"url": "https://www.theguardian.com/world/2017/jul/14/small-town-children-at-risk-of-exploitation-by-criminal-gangs-say-mps",
			"author": "Richard Adams"
		}, {
			"title": "Defence Force given power to help police deal with terrorism attacks",
			"agencyName": "ABC News (AU)",
			"publishedAt": "2017-07-17T04:00:22Z",
			"url": "http://www.abc.net.au/news/2017-07-17/australian-defence-force-given-call-out-powers-terrorism/8715878",
			"author": "http://www.abc.net.au/news/louise--yaxley/5553226"
		}],
		"keywords": ["requests", "supplying", "2016", "freedom", "arrested", "children", "turning", "almost", "england", "16", "71", "heroin", "reveal", "cent", "suspicion", "independent", "forces", "ireland", "hard", "drugs", "young", "wales", "crack", "revealed", "per", "arrest", "information", "records", "cocaine", "country", "northern", "age", "according", "peddle", "dealing", "12", "including", "areas", "class", "police", "criminals"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2009/03/12/21/147614.bin",
		"publishedAt": "2017-07-14T20:37:53Z",
		"countryName": "Great Britain",
		"description": "Children in almost all areas of the country are being arrested for dealing Class A drugs, including crack, heroin and cocaine, The Independent can reveal.  Criminals are turning to children as young as 12 to peddle hard drugs, according to police arrest records. Freedom of Information requests to police forces in England, Wales and Northern Ireland revealed that in 2016, 71 per cent of forces arrested children under the age of 16 on suspicion of supplying crack, heroin or cocaine.",
		"title": "Gangs recruiting children as young as 12 as Class A drug dealers",
		"countryId": "gb",
		"agencyName": "Independent",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/home-news/gangs-children-child-drug-dealers-class-a-aged-12-eight-youngest-arrested-young-younger-heroin-crack-a7826551.html"
	}, {
		"_id": {
			"$oid": "5969d25f6e4e49c17d82d97c"
		},
		"author": "Joshua Barrie",
		"name": "karthick",
		"others": [{
			"title": "Bronx shooting: Gunman dies after shooting multiple people at New York Hospital",
			"agencyName": "Independent",
			"publishedAt": "2017-06-30T20:05:22Z",
			"url": "http://www.independent.co.uk/news/world-0/bronx-shooting-hospital-new-york-lebanon-latest-news-updates-gunman-police-injured-a7817786.html",
			"author": "Clark Mindock"
		}, {
			"title": "Wimbledon: 'Sexist' scheduling leaves new mum Azarenka away from baby all day",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-04T15:55:23Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/04/wimbledon-sexist-scheduling-leaves-new-mum-azarenka-away-baby/",
			"author": null
		}, {
			"title": "British judge looks for new evidence in case of critically-ill baby",
			"agencyName": "Reuters",
			"publishedAt": "2017-07-10T18:53:42Z",
			"url": "http://www.reuters.com/article/us-britain-baby-idUSKBN19V18J",
			"author": "Reuters Editorial"
		}, {
			"title": "7 rules for meeting a new baby",
			"agencyName": "USA Today",
			"publishedAt": "2017-07-19T11:48:31",
			"url": "https://www.usatoday.com/videos/news/2017/07/19/7-rules-meeting-new-baby/103826608/",
			"author": "Wochit-All"
		}, {
			"title": "Live stream: Shooting at a New York City hospital",
			"agencyName": "USA Today",
			"publishedAt": "2017-06-30T20:17:07.283+00:00",
			"url": "https://www.usatoday.com/story/news/nation/2017/06/30/live-stream-shooting-new-york-city-hospital/103326958/",
			"author": null
		}],
		"keywords": ["kellaway", "inspired", "shoot", "cork", "floral", "sharon", "ireland", "beyoncé"],
		"agencyId": "mirror",
		"urlToImage": "http://i3.mirror.co.uk/incoming/article10802908.ece/ALTERNATES/s1200/20106277_10155367058591287_6929202367129754081_n.jpg",
		"publishedAt": "2017-07-15T08:59:07Z",
		"countryName": "Great Britain",
		"description": "Sharon Kellaway, from Cork in Ireland, was inspired by Beyoncé's floral shoot",
		"title": "Mum recreates new Beyonce baby shoot in her garden – and it might be even better",
		"countryId": "gb",
		"agencyName": "Mirror",
		"category": "general",
		"url": "http://www.mirror.co.uk/news/weird-news/mum-recreates-new-beyonce-baby-10802765"
	}, {
		"_id": {
			"$oid": "5969dfe86e4e49c17d82d9cc"
		},
		"author": "Rob Merrick",
		"name": "karthick",
		"others": [{
			"title": "NHS pay cap can be lifted without significant costs, says doctor who is Tory MP",
			"agencyName": "Independent",
			"publishedAt": "2017-07-08T20:02:55Z",
			"url": "http://www.independent.co.uk/news/uk/politics/nhs-pay-gap-cost-government-tory-mp-doctor-dan-poulter-calls-on-theresa-may-a7827846.html",
			"author": "Rob Merrick"
		}, {
			"title": "Theresa May 'called David Cameron' to beg for his support on DUP deal",
			"agencyName": "Independent",
			"publishedAt": "2017-07-03T12:05:23Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-david-cameron-dup-deal-support-minority-government-conservative-leader-working-majority-a7820611.html",
			"author": "Harriet Agerholm"
		}, {
			"title": "'So there is a magic money tree?' Liam Fox challenged on Question Time over £1bn DUP deal",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-06-30T12:30:45Z",
			"url": "http://www.telegraph.co.uk/news/2017/06/30/magic-money-tree-liam-fox-challenged-question-time-1bn-dup-deal/",
			"author": null
		}, {
			"title": "Theresa May's £1billion DUP deal faces High Court challenge",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-09T18:08:31Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/09/theresa-mays-1billion-dup-deal-faces-high-court-challenge/",
			"author": null
		}, {
			"title": "Theresa May warns plotting Tory MPs 'it's me or Corbyn'",
			"agencyName": "Independent",
			"publishedAt": "2017-07-18T08:07:15Z",
			"url": "http://www.independent.co.uk/news/uk/politics/theresa-may-conservative-mps-party-jeremy-corbyn-leader-minority-government-brexit-cabinet-prime-a7846366.html",
			"author": "Rob Merrick"
		}],
		"keywords": ["party", "damage", "deliver", "embarrassingly", "sarah", "theresa", "power", "warned", "prop", "“draconian", "england", "majority", "huge", "safety", "similar", "conservatives", "deal", "nhs", "patient", "ireland", "attacked", "service", "may", "forced", "measures”", "commons", "doctor", "democratic", "public", "mp", "wollaston", "£1bn", "signed", "handed", "northern", "health", "dr", "cuts", "linked", "would", "directly", "unionist", "sums", "conservative", "10"],
		"agencyId": "independent",
		"urlToImage": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/10/30/18/sarah-wollaston.jpg",
		"publishedAt": "2017-07-15T09:13:28Z",
		"countryName": "Great Britain",
		"description": "A Conservative MP and doctor has attacked huge NHS cuts in England, while similar sums are handed out in Northern Ireland to prop up Theresa May in power. Sarah Wollaston warned the health service in England was being forced into “draconian measures” that would damage both public health and patient safety. Embarrassingly for No 10, Dr Wollaston linked the cuts directly to the £1bn deal signed with the Democratic Unionist Party to deliver the Conservatives a majority in the Commons.",
		"title": "Tory MP and doctor condemns Theresa May for huge NHS cuts while handing money to DUP",
		"countryId": "gb",
		"agencyName": "Independent",
		"category": "general",
		"url": "http://www.independent.co.uk/news/uk/politics/sarah-wollaston-democratic-unionist-party-dup-tories-deal-prime-minister-austerity-a7842476.html"
	}, {
		"_id": {
			"$oid": "596b922a6e4e49c17d82e614"
		},
		"author": null,
		"name": "karthick",
		"others": [{
			"title": "Moneybags Philip Hammond will pay for treating grafters with contempt",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-17T06:45:02Z",
			"url": "http://www.mirror.co.uk/news/politics/moneybags-chancellor-philip-hammond-pay-10812541",
			"author": "Kevin Maguire"
		}, {
			"title": "Paul Ryan: I'm worried Obamacare will stand - CNN Video",
			"agencyName": "CNN",
			"publishedAt": null,
			"url": "http://www.cnn.com/videos/politics/2017/07/18/paul-ryan-worried-obamacare-will-stand-sot.cnn",
			"author": null
		}, {
			"title": "More than 80,000 Italians apply for just 30 bank jobs, as economy remains in doldrums",
			"agencyName": "The Telegraph",
			"publishedAt": "2017-07-03T14:52:24Z",
			"url": "http://www.telegraph.co.uk/news/2017/07/03/80000-italians-apply-just-30-bank-jobs-economy-remains-doldrums/",
			"author": null
		}, {
			"title": "MP reveals death threats he got for testifying in Northern Ireland bomb trial",
			"agencyName": "Mirror",
			"publishedAt": "2017-07-05T20:14:46Z",
			"url": "http://www.mirror.co.uk/news/politics/mp-reveals-received-death-threats-10745335",
			"author": "Jon Vale, Lizzy Buchan"
		}, {
			"title": "Ravi Shastri formally applies for India head coach job - Times of India",
			"agencyName": "The Times of India",
			"publishedAt": "2017-07-03T18:55:00Z",
			"url": "http://timesofindia.indiatimes.com/sports/cricket/news/ravi-shastri-formally-applies-for-india-head-coach-job/articleshow/59426226.cms",
			"author": null
		}],
		"keywords": ["bew", "northern", "historian", "ireland", "paul", "distinguished"],
		"agencyId": "the-telegraph",
		"urlToImage": "http://www.telegraph.co.uk/content/dam/news/2017/06/25/TELEMMGLPICT000132903120-xlarge_trans_NvBQzQNjv4BqM37qcIWR9CtrqmiMdQVx7GreuLw5J7BbeArdWDplvkY.jpeg",
		"publishedAt": "2017-07-16T17:57:39Z",
		"countryName": "Great Britain",
		"description": "Paul Bew is a distinguished historian of, and from, Northern Ireland.",
		"title": "If we treat our MPs with contempt, only the contemptible will apply for the job",
		"countryId": "gb",
		"agencyName": "The Telegraph",
		"category": "general",
		"url": "http://www.telegraph.co.uk/news/2017/07/16/treat-mps-contempt-contemptible-will-apply-job/"
	}, {
		"_id": {
			"$oid": "596cc2816e4e49c17d82ef90"
		},
		"author": "By Simon Holmes For Mailonline",
		"name": "karthick",
		"others": [{
			"title": "Paris Jackson shows off toned tummy in bikini top",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-10T17:28:58Z",
			"url": "http://www.dailymail.co.uk/tvshowbiz/article-4682468/Paris-Jackson-shows-toned-tummy-bikini-top.html",
			"author": "By Dailymail.com Reporter"
		}, {
			"title": "Vivendi trying to get own manager into top role at Telecom Italia...",
			"agencyName": "Daily Mail",
			"publishedAt": "2017-07-13T12:28:37Z",
			"url": "http://www.dailymail.co.uk/wires/reuters/article-4692880/Vivendi-trying-manager-role-Telecom-Italia-sources.html",
			"author": "By Reuters"
		}, {
			"title": "‘Wonder Woman’ is the highest-grossing live-action film directed by a woman",
			"agencyName": "Entertainment Weekly",
			"publishedAt": "2017-06-25T15:52:44Z",
			"url": "http://ew.com/movies/2017/06/25/wonder-woman-highest-grossing-film-female-director/",
			"author": "Nivea Serrao"
		}, {
			"title": "We bet you can't find all the crafty cats hiding in these photos",
			"agencyName": "Mashable",
			"publishedAt": "2017-07-03T12:07:29.399Z",
			"url": "http://mashable.com/2017/07/03/cats-hiding-twitter/",
			"author": "Sam Haysom"
		}, {
			"title": "Woman Jailed For Chasing Officers Who Were Trying To Protect Boyfriend",
			"agencyName": "The Lad Bible",
			"publishedAt": "2017-07-14T20:11:37",
			"url": "http://www.ladbible.com/news/uk-weird-woman-jailed-for-chasing-officers-who-were-trying-to-protect-boyfriend-20170714",
			"author": "Stewart Perrie"
		}],
		"keywords": ["packed", "neighbour", "work", "kitchen", "top", "away", "clip", "shows", "action", "homeowner", "trashing", "tries", "ireland", "short", "shoo", "cat", "animal"],
		"agencyId": "daily-mail",
		"urlToImage": "http://i.dailymail.co.uk/i/pix/2017/07/17/15/426B485200000578-0-image-a-78_1500300329928.jpg",
		"publishedAt": "2017-07-17T14:59:12Z",
		"countryName": "Great Britain",
		"description": "The short but action packed clip shows a neighbour's cat trashing a kitchen work top in Ireland as the homeowner tries to shoo the animal away.",
		"title": "Woman walks finds a feline intruder trashing her kitchen",
		"countryId": "gb",
		"agencyName": "Daily Mail",
		"category": "entertainment",
		"url": "http://www.dailymail.co.uk/news/article-4703882/Woman-kitchen-finds-feline-intruder-trashing-kitchen.html"
	}, {
		"_id": {
			"$oid": "596e1a116e4e49c17d82fd72"
		},
		"author": "ESPNcricinfo staff",
		"name": "karthick",
		"others": [{
			"title": "Lions head coach Warren Gatland laughs off treatment by New Zealand press after being mocked up as a cartoon clown",
			"agencyName": "TalkSport",
			"publishedAt": "2017-06-27T12:10:57Z",
			"url": "http://talksport.com/rugby-union/lions-head-coach-warren-gatland-laughs-treatment-new-zealand-press-after-being-mocked",
			"author": "talkSPORT"
		}, {
			"title": "Steve Davis appointed Leyton Orient head coach on two-year contract",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-10T15:49:47Z",
			"url": "http://talksport.com/football/steve-davis-appointed-leyton-orient-head-coach-two-year-contract-170710246135",
			"author": "talkSPORT"
		}, {
			"title": "The Head Coach Championship Belt: Top pro coach in every year",
			"agencyName": "ESPN",
			"publishedAt": "2017-07-12T11:15:00Z",
			"url": "http://www.espn.com/nfl/story/_/id/19952815/the-head-coach-championship-belt-top-pro-sports-coach-every-year",
			"author": "Bill BarnwellESPN Staff Writer "
		}, {
			"title": "British and Irish Lions: Warren Gatland could coach All Blacks - Sir Graham Henry",
			"agencyName": "BBC Sport",
			"publishedAt": "2017-07-03T12:46:54Z",
			"url": "http://www.bbc.co.uk/sport/rugby-union/40482238",
			"author": "BBC Sport"
		}, {
			"title": "Decision on next India coach deferred",
			"agencyName": "ESPN Cric Info",
			"publishedAt": "2017-07-10T14:23:12Z",
			"url": "http://www.espncricinfo.com/india/content/story/1110379.html",
			"author": "ESPNcricinfo staff"
		}],
		"keywords": ["'mutual'", "ceo", "deutrom", "part", "ways", "bracewell", "cricket", "decision", "warren", "ireland", "confirmed"],
		"agencyId": "espn-cric-info",
		"urlToImage": "http://www.espncricinfo.com/db/PICTURES/CMS/245500/245537.3.jpg",
		"publishedAt": "2017-07-18T14:49:16Z",
		"countryName": "United States",
		"description": "Cricket Ireland's CEO Warren Deutrom confirmed the decision to part ways with Bracewell was 'mutual'",
		"title": "Bracewell to step down as Ireland's head coach",
		"countryId": "us",
		"agencyName": "ESPN Cric Info",
		"category": "sport",
		"url": "http://www.espncricinfo.com/ireland/content/story/1111836.html"
	}, {
		"_id": {
			"$oid": "596e74af6e4e49d3560e23df"
		},
		"author": "BBC Sport",
		"name": "karthick",
		"others": [{
			"title": "World Para-athletics Championships: Aled Davies wins discus gold",
			"agencyName": "BBC Sport",
			"publishedAt": "2017-07-16T10:12:08Z",
			"url": "http://www.bbc.co.uk/sport/disability-sport/40623112",
			"author": "BBC Sport"
		}, {
			"title": "World Para-athletics Championships: Britain's Stef Reid wins gold in T44 long jump",
			"agencyName": "BBC Sport",
			"publishedAt": "2017-07-15T11:47:19Z",
			"url": "http://www.bbc.co.uk/sport/disability-sport/40618647",
			"author": "BBC Sport"
		}, {
			"title": "World Para-athletics Championships: Britain's Hannah Cockroft wins T34 100m gold",
			"agencyName": "BBC Sport",
			"publishedAt": "2017-07-14T20:56:43Z",
			"url": "http://www.bbc.co.uk/sport/disability-sport/40615434",
			"author": "BBC Sport"
		}, {
			"title": "World Para-athletics Championships: Olivia Breen wins long jump gold in London",
			"agencyName": "BBC Sport",
			"publishedAt": "2017-07-17T10:42:49Z",
			"url": "http://www.bbc.co.uk/sport/athletics/40628963",
			"author": "BBC Sport"
		}, {
			"title": "2017 World Para-athletics Championships - day one",
			"agencyName": "BBC Sport",
			"publishedAt": "2017-07-14T17:56:29Z",
			"url": "http://www.bbc.co.uk/sport/live/disability-sport/40309730",
			"author": "BBC Sport"
		}],
		"keywords": ["winning", "second", "jason", "smyth", "para-athlete", "fastest", "world’s", "championships", "confirms", "status", "gold", "world", "para-athletics", "ireland"],
		"agencyId": "bbc-sport",
		"urlToImage": "http://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/166C9/production/_96994819_gettyimages-815665260.jpg",
		"publishedAt": "2017-07-18T21:31:40Z",
		"countryName": "Great Britain",
		"description": "Ireland's Jason Smyth confirms his status as the world’s fastest para-athlete by winning a second gold at the World Para-Athletics Championships.",
		"title": "World Para-athletics Championships: Jason Smyth wins gold as GB miss out on medals",
		"countryId": "gb",
		"agencyName": "BBC Sport",
		"category": "sport",
		"url": "http://www.bbc.co.uk/sport/disability-sport/40651236"
	}, {
		"_id": {
			"$oid": "596e7d406e4e49d3560e24e9"
		},
		"author": "talkSPORT",
		"name": "karthick",
		"others": [{
			"title": "Super League news: Hull KR sign Leeds captain Danny McGuire on two-year deal",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-17T17:51:17Z",
			"url": "http://talksport.com/rugby-league/super-league-news-hull-kr-sign-leeds-captain-danny-mcguire-two-year-deal-170717247065",
			"author": "talkSPORT"
		}, {
			"title": "Super League news: Nick Rawsthorne signs new deal at Hull FC",
			"agencyName": "TalkSport",
			"publishedAt": "2017-06-29T18:07:56Z",
			"url": "http://talksport.com/rugby-league/super-league-news-nick-rawsthorne-signs-new-deal-hull-fc-170629244818",
			"author": "talkSPORT"
		}, {
			"title": "AFC Bournemouth news: Harry Arter signs new four-year deal with Premier League club",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-13T17:30:34Z",
			"url": "http://talksport.com/football/afc-bournemouth-news-harry-arter-signs-new-four-year-deal-premier-league-club-170713246628",
			"author": "talkSPORT"
		}, {
			"title": "Super League: Salford 36-20 Huddersfield: Red Devils climb into second place",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-02T16:30:33Z",
			"url": "http://talksport.com/rugby-league/super-league-salford-36-20-huddersfield-red-devils-climb-second-place-170702245077",
			"author": "talkSPORT"
		}, {
			"title": "Super League news: Mike McMeeken signs new deal with Castleford Tigers",
			"agencyName": "TalkSport",
			"publishedAt": "2017-07-05T18:32:54Z",
			"url": "http://talksport.com/rugby-league/super-league-news-mike-mcmeeken-signs-new-deal-castleford-tigers-170705245566",
			"author": "talkSPORT"
		}],
		"keywords": ["big", "australian", "friday", "signing", "available", "ian", "really", "kr", "double-chasing", "us", "signed", "mccarthy", "st", "deadline", "super", "coach", "forward", "leadership", "devils", "international", "ireland", "club", "8s", "joins", "warrington", "red", "salford", "experience", "also", "side", "illawarra", "bring", "ahead", "tyrone", "former", "george", "hull", "watson", "ability", "said:", "29-year-old"],
		"agencyId": "talksport",
		"urlToImage": "http://talksport.com/sites/default/files/field/image/201707/tyrone_mccarthy2.jpg",
		"publishedAt": "2017-07-18T20:19:03Z",
		"countryName": "Great Britain",
		"description": "Salford have signed former Warrington and Hull KR forward Tyrone McCarthy from Australian club St George Illawarra. The 29-year-old Ireland international joins the double-chasing Red Devils ahead of Friday's signing deadline and will be available for the Super 8s. Salford coach Ian Watson said: \"Tyrone is a really big signing for us. Not only will he bring ability and experience to the side, but also leadership.",
		"title": "Super League news: Salford sign forward Tyrone McCarthy ahead of the Super 8s",
		"countryId": "gb",
		"agencyName": "TalkSport",
		"category": "sport",
		"url": "http://talksport.com/rugby-league/super-league-news-salford-sign-forward-tyrone-mccarthy-ahead-super-8s-170718247227"
	}
]